INSERT INTO books_full_text (book_slug, chapter_title, page_number, arabic_matn) VALUES
('fatawa-qazi-khan', 'مؤلفات الإمام محمد', 55, '"الجامع الكبير"  من أهمّ مصنفات الإمام محمد وأعمقها وأدقّها فقها، ويعتبر من أجلّ كتب ظاهر الرواية لاحتوائه على مسائل عَويصة وفروق فقهية دقيقة، وهذا الكتاب يمثل ظاهرة التعليل وضبط الفروع بالأصول خير تمثيل، وكان يحتار في فهمه كبار العلماء، ولذا كان يعدّ معيارا لدى الفقهاء يختبر به تفاوت مداركهم ومبلغ يقظتهم في الفقه.  يقول الإمام السرخسي رحمه الله:   "من أراد امتحان المتبحرين في الفقه، فعليه بأيمان الجامع"   (١) .

وروى ابن أبي العوام بسنده عن الأخفش ثناء بالغا في حق هذا الكتاب  (٢) .

وقال عنه ابن شجاع:   "لم يؤلف في الإسلام مثله في الفقه"   (٣) .

وقال عنه الإمام أبو بكر الرازي في شرحه للجامع الكبير:  كنت أقرأ بعض مسائل من الجامع الكبير على بعض المبرزين في النحو  (يعني أبا علي الفارسي)  فكان يتعجب من تغلغل واضع الكتاب في النحو  (٤) .

وروى الجامع الكبير جماعة من أصحاب الإمام محمد،  ومن أشهر رواة الكتاب:  أبو سليمان الجوزجاني، وأبو حفص الكبير، وعلي بن معبد بن شدّاد، وهشام بن عبيد الله الرازي، ومحمد بن سَماعة التميمي.

وصنف الإمام محمد الجامع الكبير مرتين:  صنفه أولا فرواه عنه أصحابه، ثم أعاد النظر فيه ثانيا، فزاد فيه أبوابا ومسائل كثيرة، وصاغ عباراته في كثير من المواضع حتى صار أحسن لفظا وأغزر معنى، فرواه عنه أصحابه ثانيا  (٥) .

ونظرا إلى صعوبة الكتاب ودقته شرحه عشرات من الأئمة المتقدمين والمتأخرين،

(١) شرح السير الكبير ١/ ٢٥٢.

(٢) انظر مقدمة "الجامع الكبير" ص ٢ للأستاذ أبي الوفاء الأفغاني.

(٣) انظر: "بلوغ الأماني" ص ٦٣.

(٤) انظر: "بلوغ الأماني" ص ٦٣.

(٥) انظر "أبو حنيفة، حياته وعصره، آراؤه وفقهه" لأبي زهرة ص ٢٣٨.'),
('fatawa-qazi-khan', 'مؤلفات الإمام محمد', 56, 'منهم الإمام الطحاوي والكرخي والجصاص الرازي والبزدوي والسرخسي وقاضي خان وغيرهم ولم تزل تلك الشروح مخطوطات محفوظة في خزانات العالم  (١) .

٤ -  "السير الصغير" :

وهو أول كتاب ألّف في علم القانون الدولي ككتاب مستقل وصل إلينا  (٢) .

وهذا الكتاب يرويه محمد عن شيخه أبي حنيفة،  يقول محقق الكتاب في تقديمه:  يبدو كأن هذا الكتاب  (أي السير الصغير)  عبارة عن تلخيص ما ورد في كتاب أستاذه الإمام أبى حنيفه في علم السير الذي أملاه على تلامذته وأصحابه، ويجدر بالذكر منهم الإمام أبو يوسف والإمام محمد بن الحسن الشيباني والإمام زفر وأبو إسحاق الفزاري وغيرهم، فرووا عنه هذا الكتاب، وزادوا، ورتّبوه بترتيبات مختلفة وهذّبوه حتى نسبت هذه الترتيبات الجديدة كلها إلى أصحابها، ولم يصل إلينا منها إلا كتاب الشيباني بكامله وبعض الأجزاء من كتاب أبى إسحاق الفزاري  (٣) .

وهذا الكتاب هو الذي أودعه بكامله الحاكم الشهيد الإمام أبو الفضل محمد بن محمد المروزي في كتابه  "المختصر"  المعروف بالكافي في فروع الحنفية، الذي لخّص كتب ظاهر الرواية، وشرحه الإمام السرخسي في المبسوط.

٥ -  "السير الكبير" :

هذا الكتاب آخر تصنيف صنّفه الإمام محمد من كتب ظاهر الرواية  (٤) ، يقول الفقيه

(١) وقد أجاد وفصّل الدكتور علي أحمد الندوي في التعريف بهذا الكتاب وبيان خصائصه ومزاياه فيرجع "الإمام محمد بن الحسن الشيباني نابغة الفقه الإسلامي" ص ٩٤ - ١٣٢.

(٢) وحقّقه أستاذنا الفاضل الدكتور محمود أحمد غازي على إحدى عشرة نسخة خطية، وقدّم له بدراسة وافية في اللغة الانكليزية، كما ترجمه إلى اللغة الانكليزية. ونشره مجمع البحوث الإسلامية، الجامعة الإسلامية العالمية إسلام آباد ١٩٩٨.

(٣) "كتاب السير الصغير" بتحقيق الأستاذ الدكتور محمود أحمد غازي صفحة: (و).

(٤) انظر: "شرح السير الكبير" للسرخسي ١/ ١.'),
('fatawa-qazi-khan', 'مؤلفات الإمام محمد', 57, 'ابن بيري:   "إذا كانت الواقعة مختلفًا فيها، فالأفضل والمختار للمجتهد أن يأخذ بالدلائل، وينظر إلى الراجح عنده، والمقلّد يأخذ بالتصنيف الأخير وهو " السير "  (١) .

وقد احتفى الرشيد بهذا الكتاب جدًّا، وأسمعه ابنيه الأمين والمأمون  (٢) .

وهذا الكتاب من جملة الكتب التي تبرز فيها شخصية الإمام محمد محدّثًا وراويةً فنراه يوثّق كلّ قول بنصوص وآثار.

ومن الموضوعات التي اعتنى بها كثيرًا في هذا الكتاب موضوع " الأمان "، فقد عقد بابًا مفصلًا، وأفاض في بحثه، وبنى مسائله على أصول فقهية ونحوية مهمة. ولذلك نوّه الإمام السرخسي بهذا الجانب في شرح الكتاب،  فقال:  " اعلم بأن أدق مسائل هذا الكتاب وألطفها في أبواب الأمان، فقد جمع بين دقائق علم النحو ودقائق أصول الفقه ....  وقيل:  … من أراد امتحان المتبحرين في النحو والفقه فعليه بأمان السير "  (٣) .

كما تعرّض الشيباني لموضوع السير في آخر كتاب الزيادات أيضا.

وكان من منهج الإمام السرخسي في شرحه أنه يغض النظر عن ذكر المسائل التي سبق بيانها في " شرح الزيادات "  (٤)  له، أو المبسوط  (٥) ، ولذلك لما وصل إلى " باب ما يكره في التفريق بين الرقيق في البيع "،  اكتفى بقوله:  " قد مر هذا الباب في  "الزيادات"  على هذا النظم والترتيب "  (٦) .

وقال في " باب الأسير والمفقود وما يصنع بما لهما " .... " اعلم بأن أكثر مسائل هذا

(١) "عمدة ذوي البصائر على الأشباه والنظائر" لابن بيري ص/ ٣ ب.

(٢) "بلوغ الأماني" ص ٦٤.

(٣) "شرح السير الكبير" للسرخسي ١/ ٢٥٣، باب أمان الحر المسلم والصبي والمرأة والعبد والذمي.

(٤) أشار السرخسي إلى كتابه "شرح الزيادات" في مواضع من كتابه المبسوط انظر ٨/ ١٢٢، ٢١/ ٣٦، ٢٣/ ٨٥، ٢٥/ ١٤٧.

(٥) انظر "الجزء العاشر من المبسوط" من ص ٢ - ١٤٤.

(٦) "شرح السير الكبير" ٥/ ٢٠٧٥٥.'),
('fatawa-qazi-khan', 'مؤلفات الإمام محمد', 58, 'الباب قد بيناها في  "شرح المختصر"  في كتاب المفقود، وإنما نذكر ههنا ما لم نبينه ثمة "  (١) .

تبين من هذين النصين أن الإمام السرخسي رحمه الله حرص كلّ الحرص على أن يتحاشى عن التكرار ويضيف في أثناء الشرح بحوثًا ومسائل جديدة لم ينبه إليها في " شرح الزيادات " والمبسوط.

والملحوظ أنه لم يصل إلينا متن الكتاب المذكور بنصه المنقول من الراويين، والذي بين أيدينا هو ما أملاه الإمام السرخسي مع شرحه المذكور.

وقد شرحه الإمام أبو الحسن علي بن الحسين السعدي  (٤٦١ هـ)  صاحب النتف في الفتاوى كما نص على ذلك الإمام قاضيخان في مواضع من فتاواه  (٢) .

٦ - " الزيادات ":

وهذا الكتاب الذي نحن بصدد إحيائه وتحقيقه متضمنا في " شرح الزيادات " للإمام قاضي خان، وقد أفردت له مبحثا مستقلا في الفصل الثالث.

٧ - " زيادات الزيادت":

ألفه بعد إملائه الزيادات على الجامع الكبير استدراكا لما فاته من المسائل.  وهو كتاب وجيز يحتوي على سبعة أبواب وهي:

١ - باب طلاق السنة يقع بالوكالة وبالجعل وغيره.

٢ - باب من الطلاق والعتاق في الصحة والمرض.

٣ - باب قسمة الكيلي من الصنفين بعضه شراء ببعض.

٤ - باب من المورايث التي تكون فيها وصية فتبطل الميراث.

٥ - باب شراء الرجل ابنه بابنه وهما عبدان وغير ذلك.

٦ - باب الولد يكون بين الرجلين الكافرين أحدهما تغلبي والآخر ليس بتغلبي.

٧ - باب من صلاة التطوع التي تستقيم أن تكون بإمام أو لا تستقيم.

(١) المصدر نفسه ٥/ ١٩٠١.

(٢) "فتاوى قاضي خان" مطبوع على هامش الفتاوى الهندية ١/ ٣٣٢.'),
('fatawa-qazi-khan', 'أسانيد كتب الإمام محمد', 59, 'وقد شرحه شمس الأئمة السرخسي، وسمّاه  "النكت" ، كما شرحه الإمام العتّابي، وقد طبع الكتاب ممزوجا مع هذين الشرحين باهتمام الأستاذ الشيخ أبي الوفاء الأفغاني في حيدر آباد، سنة ١٣٧٨ هـ.

[أسانيد كتب الإمام محمد]

ومما تجدر الإشارة إليه أن كتب الإمام محمد بن الحسن تتميّز بكونها مروية بأسانيدها، فتذكر في غالب الأثبات والمعاجم على اختلاف القرون أسانيد كثيرة من كتب محمد بن الحسن، منها الآثار والمسند والموطأ والأصول الستة له.

وكان العلامة الجمال الحصيرى تلميذ قاضي خان انفرد في عصره بروايتها سماعا بعلو عن الحسن بن منصور الأوزجندي، عن الظهير الحسن المرغيناني عن عمه أبي القاسم محمد بن عبد العزيز عن شمس الأئمة السرخسي بأسانيده المروية في الكتب الستة وعن الحصيري يرويها الصدر سليمان الأذرعي وعنه الشمس السروجي وعنه القطب عبد الكريم الحلبي وعنه عبد القادر القرشي وعنه القاض الزين المراغي وعنه يحيى بن محمد الآقصرائي وعنه البرهان الكركي وعنه السراج الحانوتي وعنه ابنه محمد وعنه الخير الرملي.

قال العلامة الكوثري بعد أن ساق هذا السند:  "وأسانيد مشايخنا إليه مدونة في الأثبات، لكن لا بأس في أن نشير هنا إلى أسانيدنا في كتب محمد بن الحسن المذكورة … ثم ذكر سنده مفصلا إليه  (١) .

وذكره الحافظ القُرشي في ترجمة أحمد بني إبراهيم بن عبد الغني بن أبي إسحاق، السروجي  (٢) .

(١) انظر "بلوغ الأماني" ص ٦٧ - ٦٨.

(٢) "الجواهر المضية" ١/ ١٢٥ - ١٢٦.'),
('fatawa-qazi-khan', 'أسانيد كتب الإمام محمد', 60, 'الفصل الثاني ترجمة الإمام فخر الدين قاضي خان صاحب شرح الزيادات

١ - اسمه ونسبه ونسبته

٢ - كنيته ولقبه وشهرته

٣ - مولده وموطنه ووفاته

٤ - أسرته ونشأته

٥ - عصر الإمام قاضي خان

٦ - مشايخه

٧ - تلامذته

٨ - سند الإمام قاضي خان في الفقه

٩ - منزلة قاضي خان بين الفقهاء الحنفية وثناء العلماء عليه

١٠ - تصحيح قاضي خان معتمد ومقدم'),
('fatawa-qazi-khan', 'الفصل الثاني ترجمة الإمام قاضي خان', 61, '[الفصل الثاني ترجمة الإمام قاضي خان]

[اسمه ونسبه ونسبته]

هو الإمام حسن، بن منصور، بن شمس الأئمة محمود، بن عبد العزيز، بن عبد الرزاق، بن أبي نصر، بن جعفر، بن سليمان  (١) ، الملقّب بفخر الدين، المعروف بقاضي خان، الأوزجندي، الفرغاني، البخاري.

[كنيته ولقبه وشهرته]

كنيته:   "أبو المفاخر، أو " أبو المحاسن "  (٢) .

لقبه:  " فخر الدين "، و " قاضي خان "، يكاد يتفق أهل التراجم على ذلك، فترجم له كمال الدين بن الفوطي في الملقبين بفخر الدين  (٣) .

أما لقبه المعروف " قاضي خان " فهو مما انفرد به واشتهر، حتى غلب على اسمه هذا اللقب، فصار معروفا به عند عامة الفقهاء وأصحاب التراجم، قديما وحديثا، يذكرونه دائما بهذا اللقب، وذكره القرشي في كتاب الألقاب من " الجواهر المضية"  (٤) ، وكذلك

(١) إن معظم أصحاب التراجم اكتفوا عند ذكر نسبه على: "حسن بن منصور بن محمود بن عبد العزيز" فقط، وما أكملته فذلك بعد التتبع في نسب أجداده في كتب التراجم.

(٢) "تلخيص مجمع الأداب" لابن الفوطي ٢/ ١٥٣، "الطبقات السنية"، رقم الترجمة ٢٤٢٠، "مفتاح السعادة" لطاش كبري زاده ٢/ ٢٧٨، "معجم المؤلفين" رقم الترجمة ٤٤٧٠، ١/ ٥٩٤.

(٣) "تلخيص مجمع الآداب في معجم الألقاب" لكمال الدين أبي الفضل عبد الرزاق بن تاج الدين أحمد المعروف بابن الفوطي الشيباني الحنبلي، (٦٤٢ هـ - ٧٢٣ هـ) ٢/ ١٥٣.

(٤) "الجواهر المضية" ٤/ ٤٢٥.'),
('fatawa-qazi-khan', 'مولده وموطنه ووفاته', 62, 'اللكنوي في الخاتمة/ الفصل الأول في تعيين المبهمات  (١) .

وبما أن لقبه هذا غلَب على اسمه الحقيقي، لذا نسبت إليه فتاواه الشهيرة،  فاشتهرت باسم:   "فتاوى قاضي خان"  و  "الفتاوى الخانية" ، ثم غلب على بعض المتأخرين من الفقهاء اختصار اسم هذا الكتاب،  فيذكرون عند إحالاتهم إليه:   "وفي قاضي خان"  أو:  "وفي الخانية"   (٢) .

ثم إنه لم يفصح المؤرّخون عن وجه شهرته بهذا اللقب، إلا أن الظاهر أن سبب شهرته هو توليته منصبَ القضاء، حتى أصبح  "قاضى القضاة"   (٣) ، كما يشعر إليه كلام تلميذه الجليل الإمام الحَصيري، وكلام ابن الفوطي، وسوف أتحدث عنه فيما بعد.

[مولده وموطنه ووفاته]

[مولده]

لم يتطرق المؤرخون وأصحاب التراجم إلى ذكر تاريخ ميلاده، إلا أنه يُستوحى من تاريخ وفيات مشايخه أن ولادته كان في العقد الثاني من القرن السادس، حيث إنه تفقه على شيخه إبراهيم الصفَّار وهو من أقدم شيوخه، وقد كانت وفاة الصفار المذكور سنة

(١) "الفوائد البهية" ص ٢٣٨.

(٢) نجد أمثلة على ذلك بكثرة في "حاشية ابن عابدين" و"الفتاوى التتارخانية" و "الفتاوى الهندية" وغيرها من كتب الفتاوى والشروح.

(٣) "القاضي": اسم لوظيفة إلا أنه استعمل كلقب فخري في أواخر العصر الفاطمي وعصر الأيوبيين والمماليك، حين كان يطلق على العلماء وموظفي الدولة عمومًا سواء كانوا متصدرين لوظيفة القضاء أم لغيرها، وجرى عرف العامة على ذلك، وأول من عرف بهذا اللقب سلمان بن ربيعة الباهلي، وهو أول قاض بالكوفة استقضاه عمر بن الخطاب، وأبو أمية شريح بن الحارث القاضي، وأبو يوسف يعقوب بن إبراهيم القاضي صاحب أبي حنيفة، وهو أول من سمي "قاضي القضاة". انظر "الألقاب الإسلامية في التاريخ والوثائق والآثار" دكتور حسن الباشا ١٩٩٧، مكتبة النهضة المصرية ص ٤٢٤. "اللباب في تهذيب الأنساب" لعز الدين بن الأثير الجزري" ٣/ ٨.'),
('fatawa-qazi-khan', 'موطنه', 63, '٥٣٤ هـ  (١) ، فلو فرضنا أن قاضيخان حين تتلمذه على الصفَّار كان عمره في حدود العشرين - وهو الغالب - لوصلنا إلى نتيجة أن ميلاده كان في العقد الثاني - والله أعلم.

موطِنه:

ولد الإمام قاضي خان في أوزجند،  وإليه ينسب الأوزْجَنديّ:  نسبة إلى أوزْجَند، بالضم والواو والزاي ساكنان،  ويقال:  الأوزكندي، نسبة إلى أوزكند، بلد بما وراء النهر من نواحي فَرغانة، وهي آخر مدن فرغانة، و  "كند"  معناه القرية بلغة أهل تلك البلاد،  كما يقول أهل الشام:   "الكَفْر"   (٢) .

الفَرْغَاني:  بفتح الفاء وسكون الراء وفتح الغين المعجمة،  هذه النسبة إلى موضعين أحدهما:  إلى فرغانة، وهي ولاية وراء الشاش من بلاد المشرق، وراء نهر جيحون وسيحون  (٣) .

والثاني إلى فرغان. قرية من قرى فارس، ينسب إليها أبو الفتح محمد بن إسماعيل الفارسي الفَرغاني  (٤) .

والإمام قاضي خان من فَرغانة الأولى، وهي الآن أهمّ مقاطعة في الجمهورية الإسلامية أوزبيكستان، وكانت فرغانة مسقط رأس العلماء الأجلاء في الإسلام، ينسب إليها كثير من العلماء  (٥) .

(١) "الفوائد البهية" ص ٧، ويأتي ترجمة إبراهم الصفار عند ذكر مشايخ قاضي خان.

(٢) "معجم البلدان" ١/ ٢٨٠.

(٣) جيحون وسيحون: نهران عظيمان يسمّيان اليوم "أموداريا" و "سرداريا"، ومنابعهما من أواسط آسيا، وطولهما على الترتيب ١٨٥٠ كم و ٢٧٠٠ كم، وترفدهما أنهار كثيرة، ومعظم مجراهما في أراضي الاتحاد السوفياتي، ويصبّان في بحيرة خوارزم التي تسمى اليوم "بحر آرال". انظر معجم البلدان، وبلدان الخلافة الشرقية ص: ٤٧٧، ٥١٦، ٥٢١.

(٤) "اللباب في تهذيب الأنساب" لعز الدين بن الأثير الجزري، ٢/ ٤٢٢.

(٥) مثل أحمد بن كثير الفرغاني، عاش في عهد الخليفة المتوكل ٢٤٧ هـ، وله أثر خالد في علم الهيئة. ومنهم أبو جعفر بن محمد بن عبد الله الفرغاني الصوفي نزل بغداد، وصَحب الجنيد. ='),
('fatawa-qazi-khan', 'وفاته', 64, '[وفاته]

قال الإمام الذهبي:   "بقي إلى سنة تسع وثمانين وخمس مائة، فإنه أملى في هذا العام"   (١) ، وترجم له الذهبي في المتوفين على التقريب من أهل الطبقة التاسعة والخمسين من  "تاريخ الإسلام"   (٢) ، إلا أن عامة المترجمين له من أبي الوفاء القرشي، وتقي الدين التميمي، وابن العماد الحنبلي، والكفوي، واللكنوي اتفقوا على أنه توفي سنة اثنتين وتسعين وخمس مائة من الهجرة، وأضاف القرشي والتميمي أنه توفي ليلة الإثنين، خامس عشر من شهر رمضان المبارك، ودُفن عند القضاة السبعة  (٣) .

[أسرته ونشأته]

نشأ الإمام قاضي خان ببخارى  (٤)  التي كانت  "مجمع الفقهاء ومعدن الفضلاء"   (٥) ، ومركزهم العلمي، وكانت مكتظّة بفطاحل العلماء وجهابذتهم،  (كما يتبين من أسماء بعض علماء منطقة بخارى في تلك الفترة الزمنية ذكرتها تحت عنوان:   "عصر الإمام قاضي خان)، وقد ذكر بعض المؤرخين أن هذه المدينة الواسعة كان " المسجد الجامع بها معدوم

= انظر بقية علماء فرغانة في "الأنساب" للسمعاني ٤/ ٣٦٧، ٣٦٨. و "اللباب في تهذيب الأنساب" لعز الدين بن الأثير الجزري، ٢/ ٤٢٢. و "تاريخ بخارى" لأبي بكر محمد بن جعفر النرشخي ٣٤٨ هـ عرّبه عن الفارسية وحقّقه الدكتور أمين عبد المجيد بدوي، ص ٢٨.

(١) "سير أعلام النبلاء" ٢١/ ٢٣٢.

(٢) "تاريخ الإسلام" ٤٠/ ٣٩٨.

(٣) انظر "الجواهر المضية" برقم ٤٨٦، ٢/ ٩٥ و "الطبقات السنية" برقم ٧٢٥، ٣/ ١١٧، و "الفوائد البهية" ص ٦٥، "كتائب أعلام الأخيار" للكفوي برقم ٣٨١، "شذرات الذهب" للمؤرخ الفقيه ابن العماد الحبلي ٤/ ٣٠٨، "تاج التراجم" لقاسم بن قطلوبغا، برقم ٨٩، ص ٨٢.

(٤) بخارى: من أعظم مدن ما وراء النهر وأجلّها، افتتحها سعيد بن عثمان بن عفّان في أيام معاوية رضي الله عنهم، وكانت مجمع الفقهاء، ومعدَن الفضلاء، ومنشأ علوم النظر. انظر: "معجم البلدان" لياقوت الحموي ١/ ٣٥٣.

(٥) "آثار البلاد وأخبار العباد" للقزويني، ص ٥١٠ دار صادر.'),
('fatawa-qazi-khan', 'أسرته ونشأته', 65, 'المثال، كثير الاحتفال "  (١) .

ولكن مما يؤسف له أن المؤرخين له لم يبسطوا القول عن نشأته وتلقيه العلم، رغم أنه تربّى، في أسرة علميّة عريقة، عرفت بالعلم والفقه والقضاء، فأبوه كان عالما وقاضيا  (٢) .

أما جدّه شمس الأئمة محمود بن عبد العزيز، وعمّه الحسين بن علي ظهير الدين المرغيناني، فكانا عَلَمين بارزين في قائمة مشايخه، وكذلك جدّ أبيه كان من كبار الفقهاء،  وفيما يلي أذكر باختصار بعض فقهاء أسرته الكبار:

١ - عبد العزيز بن عبد الرزاق، بن أبي نصر بن جعفر بن سليمان، الإمام، المرغيناني،  (والد جدّ قاضي خان)  روى عنه أولاده  (٣) .

ونقل القرشي عن أبي سعد قال:  كان له ست بنين، كلهم يصلح للفتوى والتدريس، فإذا خرج مع أولاده،  قالوا:  سبعة من المفتين خرجوا من دار واحدة.

مات بمرغينان سنة سبع وسبعين وأربعمائة،  وقال الكفوي:  وأشهر أبنائه أبو الحسن ظهير الدين على بن عبد العزيز، وشمس الأئمة محمود الأوزجندي،  وأشار اللكنوي إلى هذه الأسرة العلمية قائلا:  " يأتي ذكر ابنه عن قريب، وابنه محمود الأوزجندي جد قاضي خان حسن بن منصور بن محمود في حرف الميم إن شاء الله تعالى  (٤) .

٢ - محمود بن عبد العزيز بن عبد الرزاق، الملقب بشمس الأئمة، الأوزجندي، جد قاضي خان وشيخه، تفقه على الإمام السرخسي.

ترجمَ له الكفوي في  "كتائب أعلام الأخيار"  فقال: "شيخ الإسلام القاضي محمود بن عبد العزيز، الأوزجندي، جدّ الشيخ الإمام قاضي خان، كان من الفقهاء

(١) "الروض المعطار في خبر الأقطار" للحميري ص ٨٢.

(٢) وهذا ما يستوحى من كلام تلميذه الحَصيري في خاتمة "فتاوى قاضي خان" فذكر والد شيخه بالقاضي الإمام الأجل بدر الدين منصور … ٣/ ٦٤٤.

(٣) انظر ترجمته في "الجواهر المضية" برقم ٨٢٦، و"الطبقات السنية" برقم ١٢٤٨، و"الأنساب" ٥٢٢، و"الفوائد البهية" ص ٩٧.

(٤) "الفوائد البهية" ص ٩٧.'),
('fatawa-qazi-khan', 'أسرته ونشأته', 66, 'العظام، والفضلاء الفخام، كان يتصدّر للإفتاء وحلّ مشكلات الأنام فيما شجر بينهم من النزاع، تفقّه على الشيخ الإمام شمس الأئمة السرخسي وأخذ عنه "  (١) .

٣ - علي بن عبد العزيز بن عبد الرزاق، الإمام، المعروف بظهير الدين الكبير، أبو الحسن، المرغيناني،  (أخ جدّ قاضي خان)  تفقّه على أبيه عبد العزيز، وعلى السيد أبى شجاع محمد بن أحمد بن حمزة، وعلى بن برهان الدين الكبير عبد العزيز وغيرهم، وهو جد صاحب " الخلاصة " من جهة الأم، وتفقّه عليه ابنه أبو المحاسن ظهير الدين الحسن بن علي، وقوام الدين أحمد بن عبد الرشيد والد صاحب الخلاصة طاهر بن أحمد.  وقال القرشي:  هو أحد الإخوة الفضلاء الستة.

والتبس الأمر على كل من القرشي والقاري فذكرا أنه أستاذ فخر الدين قاضيخان، فتعقّب عليه الكفوي واللكنوي بأن أستاذ قاضى خان هو ظهير الدين الحسن بن علي بن عبد العزيز المرغيناني لا أبوه ظهير الدين الكبير. وهو الصحيح فإنه توفي سنة ست وخمسمائة  (٢) .

٤ - المعلّى بن عبد العزيز بن عبد الرزاق، " أحد الأخوة الفضلاء الستة "  (٣) .

٥ - الحسن بن علي ظهير الدين الكبير بن عبد العزيز بن عبد الرزاق، المرغيناني، الملقّب بظهير الدين، أبو المحاسن. شيخ قاضي خان.

كان فقيها محدّثا، نشر العلمَ إملاء وتصنيفا،  ومن مصنفاته:  " كتاب الأقضية " والشروط و " الفتاوى " و " الفوائد" وغير ذلك، تفقه على برهان الدين الكبير عبد العزيز بن

(١) انظر "كتائب أعلام الأخيار" لمحمود بن سليمان الكفوي المتوفي ٩٩٠، ترجمة برقم ٢٩٩، ص ٣٠٠، مخطوط بدار الكتب المصرية تحت رقم ٨٤ م. وانظر ترجمته في: "الجواهر المضية" برقم ١٦٢٦، و"الطبقات السنية" برقم ٢٤٤١، و "طبقات الفقهاء" لابن كمال باشا ص ٣٣، و"الفوائد البهية" ص ٢٠٩ و ٢٤٢.

(٢) انظر ترجمته في "الجراهر المضية" برقم ٩٨٢، و "الطبقات السنية" برقم ١٥٠٨، و"الفوائد البهية" ص ١٢١ - ١٢٣، و "كتائب أعلام الأخيار" برقم ٣٢٢، و"هدية العارفين" ١/ ٦٩٤.

(٣) ترجمته في "الجواهر المضية" برقم ١٦٧٩، و "الطبقات السنية" برقم ٢٥٢٣.'),
('fatawa-qazi-khan', 'عصر الإمام قاضي خان', 67, 'عمر بن مازه، وعلى عمّه شمس الأئمة محمود الأوزجندي  (جدّ قاضي خان) ، وسوف يأتي ذكره في مشايخ قاضي خان.

وفي آخر ترجمته نوّه العلامة اللكنوي بهذه الأسرة النبيلة قائلا:   "يأتى ذكر أبيه، وجده، وعمه محمود الأوزجندي، وابن ابن عمه قاضي خان حسن بن منصور بن محمود، وابن أخته طاهر صاحب خلاصة الفتاوى إن شاء الله تعالى  (١) .

٦ - طاهر بن أحمد  (٢)  بن عبد الرشيد بن الحسين، افتخار الدين، البخاري. تلميذ قاضي، خان وابن أخت عمّه.

صاحب " خلاصة الفتاوى " و " خزانة الواقعات " و" النصاب"، كان عديم النظير في زمانه، فريد أئمة الدهر، شيخ الحنفية بما وراء النهر، من أعلام المجتهدين في المسائل، يأتي ذكره في تلامذة قاضي خان.

[عصر الإمام قاضي خان]

عاش الإمام قاضي خان رحمه الله في القرن السادس الهجري، حيث ولد بأوزجند، فرغانة قبل عام ٥١٨ هـ، وتوفي ببخاري عام ٥٩٢ هـ، أي في أواخر عصر الدولة العباسية. الثانية التي سقطت عام ٦٥٦ هـ بسقوط بغداد على يد التتار.

وقد كان هذا العصر عصر ضعف وانهيار للدولة العباسية، كثرت الفتن والاضطرابات، ونجمت بجانب الدولة العباسية عدة دول.  قال ابن كثير:  ولم تكن أيدي بني العباس حاكمة على جميع البلاد فإنه خرج عن بني العباس بلاد المغرب، وبلاد الشام في بعض الأخيان والحرمين في أزمان طويلة. وكذلك أخذت من أيديهم بلاد خراسان وما وراء النهر، وتداولتها الملوك دولا بعد دول حتى لم يبق مع الخليفة منهم إلا بغداد وبعض بلاد العراق؛ وذلك لضعف خلافتهم واشتغالهم بالشهوات وجمع الأموال في أكثر

(١) "الفوائد البهية" ص - ٦٦.

(٢) ذكره المولى ابن كمال باشا الرومي من طبقة المجتهدين في المسائل الذين يقدرون على الاجتهاد في المسائل التي لا رواية فيها من صاحب المذهب، ولا يقدرون على مخالفته في الفروع والأصول.'),
('fatawa-qazi-khan', 'عصر الإمام قاضي خان', 68, 'الأوقات"  (١) .

وعاصَر الإمام قاضي خان من خلفاء بني العباس:

١ - الفضل المسترشد بالله بن المستظهر  (٥١٢ هـ - ٥٢٩ هـ) .

٢ - المنصور الراشد بالله بن المسترشد  (٥٢٩ هـ - ٥٣٠ هـ) .

٣ - المقتفي بأمر الله محمد بن المستظهر بالله  (٥٣٠ هـ - ٥٥٥ هـ) .

٤ - المستنجد بالله أبو المظفر يوسف بن المقتفي  (٥٥٥ هـ - ٥٦٦ هـ) .

٥ - المستضيء بأمر الله أبو محمد الحسن بن يوسف  (٥٦٦ هـ - ٥٧٥ هـ) .

٦ - الناصر لدين الله العباس أحمد بن المستضيء  (٥٧٥ هـ - ٦٢٢ هـ)   (٢) .

وقد كانت القوة المسيطرة على الخلافة في أواخر الدولة العباسية دولة السلاجقة، وهم شعب من شعوب الترك يعرفون باسم العز، هاجروا إلى ما وراء النهر عام ٣٧٥ هـ. وكان السلطان السلجوقي ملكشاه قد أعطى أنوشتكين - أحمد سقاه بلاطه بلد خوارزم، فبدأ أنوشتكين ملكه لخوارزم عام ٤٧٠ هـ ثم تعاقب على هذا الملك أحفاده من بعده بإقرار من ملوك السلاجقة، وخضوع من ملوك خوارزم في أغلب الأحيان إلى أن بدأت الخلافات تنشب بينهما حيث طمع ملوك خوارزم في الاستقلال عن السلاجقة، والاستئثار بالسلطة على البلاد التي تحت أيديهم وأعلنوا ذلك، فقامت المعارك بينهما.

وقد كان في كل مدينة حاكم مَحليّ أو نائب من المسلمين يتولى إدارة الشؤون الداخلية والنواحي الدينية، ويقوم بدفع ضريبة للقر اخطائيين.

وكان الحكم المحلى الذي له المشورة في جميع الأمور في بخارى هو:  تاج الدين أحمد بن عبد أحمد بن عمر بن مازة، وذلك بعد مقتل الصدر الشهيد، ثم كان الحاكم

(١) انظر: البداية والنهاية لابن كثير ١٣/ ٢٠٥.

وبلاد ما وراء النهر يراد به ما وراء نهر جيحون من جهة الشرق، وما كان من جهة غرب النهر فهو خراسان وولاية خوارزم، وهي من أخصب البلاد. انظر: "معجم البلدان" لياقوت الحموي ٥/ ٤٥.

(٢) ينظر: "البداية والنهاية" ١٢/ ٢١١، ٢٤١، ٢٦٢، ٣٠٤، ١٣/ ١٠٦.'),
('fatawa-qazi-khan', 'عصر الإمام قاضي خان', 69, 'محمد بن أحمد بن عبد العزيز بن محمد بن الصدر الشهيد عمر بن عبد العزيز البخاري الملقب بصدر جهان، وكان الحاكم بسمرقند السلطان عثمان بن إبراهيم بن حسين.  (١)

ولا شك أن ضعف الخلافة العباسية، وعدم الاستقرار السياسي، وكثرة الحروب كان له الأثر الكبير على الجوانب الاجتماعية والاقتصادية والعلمية في ذلك العصر، إلا أنه رغم الاضطراب السياسي وأحداث داخلية وخارجية كانت هناك حركات علمية ونهضة أدبية في بخارى وسمرقند وما جاورها من البلاد الإسلامية، ازدهرت فيها الحضارة والعلوم والآداب، يتمثل ذلك في التأليف والتدريس والقضاء والإفتاء وبناء المدارس الإسلامية والمكتبات العلمية في أنحاء العالم الإسلامي، ومن ذلك ما أسّسه الوزير السلجوقي نظام الملك الحسن بن علي الطوسي ٤٨٥ هـ، من مدارس نظامية في المدن الإسلامية الكبرى  (٢) .

أنجبَ هذا العصر علماء وفقهاء أفذاذا كانوا أئمّة في العلوم النقلية والعقلية، ووجد فيه أعلام من الفقهاء الذين كان لهم دور كبير في توضيح المذهب وتطويره وتهذيبه، لذلك أصبحت أقوالهم محل الاعتماد والتعويل في الذهب.

وفي هذه الفترة الزمنية التي عاشها الإمام قاضي خان بمدينة بخارى،  وجدت بها وما جاورها طائفة من جهابذة العلماء:  بعضهم من الطبقة الثالثة: طبقة المجتهدين في المسائل التي لا رواية فيها عن صاحب المذهب،  وأكثرهم من الطبقة الرابعة:  طبقة أصحاب التخريج،  والخامسة:  طبقة أصحاب الترجيح،  وفيما يلي أذكر أشهر فقهاء الحنفية الذين عاصرهم قاضي خان في تلك المنطقة:

١ - ركن الإسلام أبو إسحاق إبراهيم بن إسماعيل الزاهد المعروف بالصفار، المتوفى سنة  (٥٣٤ هـ)  شيخ قاضي خان.

(١) انظر: الكامل ١٢/ ٢٥٧، ٢٥٨، دائرة المعارف الإسلامية ٣/ ٤١١، ٦٠٢، أوضاع الدول الإسلامية في الشرق الإسلامي لسعيد بن محمد الغامدي/ ١٨٥/ ١٨٧.

(٢) ينظر: "طبقات الشافعية الكبرى" للسبكي، ٤/ ٢٥٦، "أحسن التقاسيم في معرفة الأقاليم" للمقدسي، ص ٢٨٤، "مقدّمة ابن خلدون" ٣/ ١٢٢٥.'),
('fatawa-qazi-khan', 'عصر الإمام قاضي خان', 70, '٢ - صدر الشهيد عمر بن عبد العزيز بن مازة  (٥٣٦ هـ)  صاحب  "شرح أدب القاضي"  للخصاف، أحد جهابذة المذهب.

٣ - شمس الأئمة محمود بن عبد العزيز الأوزجندي، جد قاضي خان.

٤ - الإمام طاهر بن أحمد بن عبد الرشيد البخاري، المتوفى سنة  (٥٤٢ هـ) ، صاحب  "خلاصة الفتاوى" .

٥ - أبو بكر علاء الدين محمد بن أحمد السمرقندي، المتوفى سنة  (٥٥٢ هـ) . صاحب  "تحفة الفقهاء" .

٦ - الإمام أبو بكر أحمد بن علي بن عبد العزيز، الظهير البلخي  (٥٥٣ هـ) .

٧ - قاضي القضاة عليّ بن أحمد بن قاضي القضاة أبي الحسن عليّ بن قاضي القضاة أبي عبد الله، الدامغاني،  (٥٨٣ هـ) .

٨ - زين الدين أبو نصر أحمد بن محمد بن عمر العتّابي،  (٥٨٦ هـ) .

٩ - ملك العلماء أبو بكر بن مسعود بن أحمد الكاساني  (٥٨٧ هـ)  صاحب البدائع.

١٠ - علي بن أبي بكر بن عبد الجليل الفرغاني المرغيناني،  (٥٩٣ هـ)  صاحب الهداية.

١١ - برهان الدين محمود بن أحمد بن عبد العزيز بن عمر بن مازة ٥٥١ هـ - ٦١٦ هـ صاحب  "المحيط البرهاني" .

وغيرهم الذين كانوا نجوما ساطعة في سماء العلم، وكل واحد منهم يتبوّأ مركزا علميا مرموقا، وكان لهم أثر كبير في الأجيال من بعدهم في ازدهار العلم وتطور المذهب، وتميّز الإمام قاضي خان بينهم في تمكّنه في الاجتهاد والقضاء والإفتاء، ورسوخه في الفقه الحنفي.'),
('fatawa-qazi-khan', 'مشايخه', 71, '[مشايخه]

لقد سبق أن الإمام قاضي خان ترعرع في بيئة علمية وتربّى في أسرة عريقة في العلم والمعرفة، وأنه عاصر كبارا من جهابذة الفقهاء، فالتقى بهم واستفاد منهم، وإن المترجمين له لم يسجّلوا شيئا عن رحلاته العلمية، كما لم يفصّلوا أسماء شيوخه الذين روى عنهم التفسير والحديث والفقه وبقية العلوم، واكتفوا بذكر أربعة من مشايخه المشهورين، ومما لا شك أن عدد مشايخه أكبر من ذلك بكثير، تدل عليه مصنفاته العلمية وما دوّن فيها من آرائهم القيمة،  وهذا ما ألمَعَ إليه الإمام الذهبي بقوله:   "سمع الكثيرَ من الإمام ظهير الدين الحسن بن علي، ومن إبراهيم بن عثمان الصفاري وطائفة"   (١) ، وفيما يلي أسجّل نبذة يسيرة.  في كبار مشايخه:

١ -  إبراهيم بن إسماعيل الصفّار:

هو إبراهيم بن إسماعيل بن أحمد بن إسحاق بن شيث بن الحكم بن أقلد بن أبان بن عُقبة بن يزيد بن رؤبة بن حقانة بن وائل بن هُضَيم بن دينار بن ضُبَيعة بن نِزار بن مَعَدّ بن عدنان، الأنصاري الوائليّ، أبو إسحاق، ركن الإسلام؛ الزاهد، المعروف بالصفار  (٢) .

من بيت علم وفضل، أبوه وجدّه وجدّ أبيه كلهم من أفاضل الحنفية، وهو تفقّه على والده، ذكر القرشي أنه ولد في حدود سنة ستين وأربعمائة، مات ببخارى في السادس والعشرين من ربيع الأول سنة ٥٣٤ هـ.

وله تصانيف،  منها:  كتاب تلخيص الزاهدي، وكتاب السنة والجماعة.

وأخذ عنه جماعة،  يقول تقي الدين التميمي الداري:  واشتغل عليه الجمّ الغفير،

(١) "سير أعلام النبلاء" ٢١/ ٢٣٢.

(٢) ذكر السمعاني في "الأنساب" عند ذكر الصفّار أنه بفتح الصاد المهملة وتشديد الفاء، في آخره راء مهملة، يقال لمن يبيع الأواني الصفرية، ثم قال: من جملة المشتهرين به أبو إسحاق إبراهيم بن إسماعيل الصفّار، المعروف بالزاهد الصفار. انظر "الأنساب" رقم الترجمة ٣٥٣.'),
('fatawa-qazi-khan', 'شمس الأئمة محمود الأوزجندي جد قاضي خان', 72, 'ومن جملتهم قاضي خان رحمه الله ".  وقال ابن الفوطي في ترجمة قاضي خان:  " روى عن أبي إسحاق إبراهيم بن إسماعيل بن أبي نصر  "الأنصاري البخاري"   (١) .

قال اللكنوي:  كان إماما ورعا زاهدا مثل والده في قمع السلاطين وقهر الملوك، حمله السلطان سنجر بن ملك شاه إلى مَرْو، وأسكنه إياها.

وقال علي القاري في كتابه  "الأثمار الجنية في طبقات الحنفية" : إبراهيم بن إسماعيل بن أحمد بن إسحاق الأنصاري أبو إسحاق الفقيه، عُرف بالصفّار، تفقّه على والده، وسمع  "الآثار للطحاوي"  على والده، وكتاب  "العالم والمتعلم"  لأبى حنيفة على أبى يعقوب السيّارى، بتشديد التحتية بقراءة والده، و "السير الكبير"  لمحمد على أبي حفص، و "كتاب الكشف"  في مناقب أبي حنيفة، تصنيف عبد الله بن محمد بن يعقوب الحارثي على ولده، وكان من أهل بخارى موصوفا بالزهد والعلم، وكان لا يخاف في الله لومة لائم  (٢) .

[٢ - شمس الأئمة محمود الأوزجندي، جد قاضي خان]

هو محمود بن عبد العزيز بن عبد الرزاق، الأوزجندي، القاضي، الملقب بشمس الأئمة  (٣) ، جد قاضي خان وشيخه، ويلقب بـ  "شيخ الإسلام"  أيضا، كما ذكره القرشي

(١) "تلخيص مجمع الآداب في معجم الألقاب" لكمال الدين أبو الفضل عبد الرزاق بن تاج الدين المعروف بابن الفوطي الشيباني الحنبلي، ٦٤٢ هـ - ٧٢٣ هـ، ٢/ ١٥٣.

(٢) انظر ترجمته في "الجواهر المضية" برقم ١١، "الطبقات السنية" برقم ٢٢، "الفوائد البهية" ص ٧، "كتائب أعلام الأخيار" برقم ٣١٧، "طبقات الفقهاء" لطاش كبري زاده ص ٩٥، "الأنساب" للسمعاني ٣٥٣، "التحبير في المعجم الكبير" ١/ ٧١.

(٣) "شمس الأئمة" لقب جماعة من العلماء والفقهاء، مثل عبد العزيز الحلواني، ومحمد السرخسي، ومحمد بن عبد الستار الكَردَري، ومحمود الأوزجندي، وبكر بن محمد الرنجري، وعند الإطلاق في كتب أصحابنا هو شمس الأئمة السرخسي، وفيما عداه يطلق مفيدًا مع الاسم أو النسبة أو بهما، كشمس الأئمة الحلواني، وشمس الأئمة الكردري، وشمس الأئمة محمود الأوزجندي. نصّ عليه اللكنوي وعزاه إلى الكفوي. انظر "الفوائد البهية" ص ٢٤٢.'),
('fatawa-qazi-khan', 'شمس الأئمة محمود الأوزجندي جد قاضي خان', 73, 'والكفوي  (١) .

ترجمَ له الكفوي في  "كتائب أعلام الأخيار"  فقال:  "شيخ الإسلام القاضي محمود بن عبد العزيز، الأوزجندي، جدّ الشيخ الإمام قاضي خان، كان من الفقهاء العظام، والفضلاء الفخام، كان يتصدّر للإفتاء وحل مشكلات الأنام فيما شجر بينهم من النزاع، تفقّه على الشيخ الإمام شمس الأئمة السرخسي وأخذ عنه"   (٢) .

تفقّه عليه الإمام قاضي خان كما صرّح به الكفوي واللكنوي  (٣) ، ودوّن بعض آرائه في كتابه  "شرح الزيادات"   (٤) .

وتكرّر ذكره في كتب الفتاوى والشروح، ونقل القرشي بعض آرائه في الجواهر  (٥) ، وله بعض المصنف في الفقه، استفاد منها ابن الهمام في  "فتح القدير" ،  وأشار إليه بقوله:  وفي فوائد شمس الإسلام الأوزجندي …  (٦) .

(١) وأفاد العلامة الكفوي في ترجمته أن لقب "شيخ الإسلام" يطلق على من تصدر للإفتاء، وحل المشكلات فيما شجر بينهم من النزاع والخصام من الفقهاء العظام، وقد اشتهر بها من أخيار المائة الخامسة والسادسة علَم منهم: شيخ الإسلام أبو الحسن على السُّغْدي، وشيخ الإسلام على بن محمد الإسبيجابي، وشيخ الإسلام برهان الدين على المرغيناني صاحب الهداية، وشيخ الإسلام محمود الأوزجندي وغيرهم، كذا ذكره اللكنوي نقلا عن الكفوي. "الفوائد البهية" ص ٢٤١.

(٢) انظر "كتائب أعلام الأخيار" لمحمود بن سليمان الكفوي المتوفي ٩٩٠، ترجمة برقم ٢٩٤، ص ٣٠٠، مخطوط بدار الكتب المصرية تحت رقم ٨٤ م. وانظر ترجمته في: "الجواهر المضية" برقم ١٦٢٥، و "الطبقات السنية" برقم ٢٤٤١، و "طبقات الفقهاء" لابن كمال باشا ص ٣٣، و "الفوائد البهية" ص ٢٠٩ و ٢٤٢.

(٣) "الفوائد البهية" ص ٦٤.

(٤) فمثلا نقل عنه قاضي خان في كتاب الأيمان باب الحنث في المين، بقولة: "وبه كان يُفتي جدّي الشيخ الإمام شمس الأئمة محمود الأوزجندي" ص ٣٤٥.

(٥) "الجواهر المضية" ترجمة برقم ١٦٢٥، ٣/ ٤٤٦.

(٦) "فتح القدير" ٣/ ١٤٧.

ولقد سعدت برؤية نسخة من هذا الكتاب أثناء زيارتي لمكتبة مراد ملا باستنبول، تقع في مجلدين: ='),
('fatawa-qazi-khan', 'ظهير الدين الحسن بن علي ظهير الدين الكبير المرغيناني', 74, '[٣ - ظهير الدين الحسن بن علي ظهير الدين الكبير المرغيناني]

هو الحسن بن علي ظهير الدين الكبير بن عبد العزيز بن عبد الرزاق بن أبي نصر، المرغيناني، الملقّب بظهير الدين، أبو المحاسن.

تفقّه على برهان الدين الكبير عبد العزيز بن عمر بن مازه، وعلى عمّه شمس الأئمة محمود الأوزجندي  (جدّ قاضي خان) ، وزكى الدين الخطيب مسعود بن الحسن الكُشَانيّ، وهم تفقهوا على شمس الأئمة السرخسي.

والإمام فخر الدين قاضي خان الذي هو ابن ابن عمّه قرابة، كان من أجل تلامذته ولازَمَه ملازمة طويلة  (١) ، وأكثَرَ في السماع منه،  أشار إليه الإمام الذهبي والعلامة قاسم بن قطلوبغا بقوله:   "سمعَ الكثيرَ من الإمام ظهير الدين حسن بن علي بن عبد العزيز"   (٢) .

وتفقّه عليه ابن أخته افتخار الدين طاهر صاحب  "خلاصة الفتاوى" ، وهو آخر المتفقهين عليه، وظهير الدين محمد بن أحمد صاحب  "الفتاوى الظهيرية" ، وذكر عبد القادر القرشي أنه روى عنه صاحبُ الهداية  "كتابَ الترمذيّ"  بالإجازة، بسماعه من برهان الأئمة عبد العزيز بن عمر.

وقال برهان الإسلام الزَّرنوجي، تلميذ صاحب الهداية في كتابه الشهير  "تعليم المتعلّم" : أنشدنا الشيخ الإمام ظهير الدين، مفتي الأمة،  حسن بن علي المعروف بالمرغيناني:

= المجلد الأول في ٢٣٥ ورق برقم ١١١٩ والمجلد الثاني في ١٨٤ ورق برقم ١١٢٥، وهو كتاب نفيس قيّم مقارن بين المذاهب، يجمع بين الأدلة والمسائل.

(١) وجدير بالتنبيه هنا أنه اشتبه هذا الأمر على القرشي وعليّ القاري، فقالا في ترجمة والده عليّ بن عبد العزيز: "هو أستاذ فخر الدين قاضيخان، وهو أحد الإخوة الفضلاء الستة"، تعقّب عليه الكفوي قائلا: "قلت: أستاذ قاضي خان ظهير الدين الحسن بن علي بن عبد العزيز المرغيناني، لا أبوه ظهير الدين الكبير"، كما تعقّب عليهما اللكنوي، وأجاد فيما أفاد، فليرجع "الفوائد البهية" ص ٢٦، ٦٣.

(٢) "سير أعلام النبلاء" ٢١/ ٢٣٢، "تاج التراجم" ص ٨٢.'),
('fatawa-qazi-khan', 'نظام الدين إبراهيم بن علي المرغيناني', 75, 'الجاهلونَ فَمَوتَى قبلَ مَوْتهمُ … والعَاِلمُونَ وإن ماتُوا فأحياءُ

وكان الإمام ظهير الدين فقيها محدّثا، نشر العلمَ إملاء وتصنيفا،  ومن مصنفاته:   "كتاب الأقضية"  و  "الشروط" ، و  "الفتاوى"  و  "الفوائد"  وغير ذلك  (١) .

٤ -  نظام الدين إبراهيم بن علي المَرْغينَاني:

هو إبراهيم بن علي، المَرْغينَاني، الملَقَّب نظام الدين، أبو إسحاق.

يقول القرشي والتميمي الداري:  أحد مشايخ قاضي خان، وأحد مَن انتفع به، وتفقّه عليه، وتخرج به رحمهما الله تعالى  (٢) .

(١) انظر ترجمته في: "الجواهر المضية" برقم ٤٦٦، "الطبقات السنية" برقم ٦٩٦، "الفوائد البهية" ص ٢٦، ٦٣، "كتائب أعلام الأخيار" برقم ٣٤٤.

(٢) انظر ترجمته في "الجواهر المضية"، برقم ٣٣، و"الطبقات السنية" برقم ٦٠.'),
('fatawa-qazi-khan', 'تلامذته', 76, '[تلامذته]

درسَ الإمام قاضي خان وتفقّه على أيدي هؤلاء المشائخ حتى بلغ إلى مرحلة النضج والرسوخ، وبعد أن ارتفع شأنه في العلم وترقّى، وتبوّأ منزلة كبيرة بين علماء زمانه حتى فاق أكثرَ فقهاء ذلك العصر في الفقه، تصدّر للتدريس والإملاء والإفتاء، فانضمّ إلى حلقته كثير من رواد العلم، ولعلّ الإمام قاضيخان كان أجلّ الفقهاء في ذلك العصر وأشهرهم، ومَن كان مثله في العلم والفضل لابدّ أن يكثر تلاميذه،  ألمَعَ إليه الإمام الذهبي بقوله:   "وأملى مجالسَ كثيرة رأيتها"   (١) .

وكذلك يدل عليه ما ساقَه القرشي والتميمي والقاري في طبقاتهم من حكاية طريفة،  وفيها:  "إن محمد بن محمد بن إبراهيم بن أحمد بن محمد بن الفضل الكماري عندما دخل بلاد فرغانة، وجَدَ قاضي خان يتكلم فوق المنبر، وبين يديه العلماء، وهم يكتبون ما يُلمي عليهم  (٢) .

(١) "سير أعلام النبلاء" ٢١/ ٢٣٢.

(٢) وتمام القصة ما حكاه العلامة اللكلنوي نقلا عن القاري: "وفي "طبقات القاري": محمد بن الفضل أبو الفضل الكمارى - بفتح الكاف والميم - يحكى أن والده وعده بألف دينار عند تمام حفظه المبسوط وكذا لأخيه، فلما حفظه دفع المال لأخيه، وقال له: يكفيك حفظ المبسوط، فخرج مغاضبًا، فانتهى به السفر إلى أن دخل بلاد فرغانة، فوجد قاضي خان يتكلم فوق المنبر، وبين يديه العلماء، وهم يكتبون ما يملى عليهم، فذكر قاضي خان مسألة خلافية بين أبى يوسف ومحمد، فعكس قول أبى يوسف وجعله قول محمد، وقول محمد قول أبي يوسف، فقال له أبو بكر: اعكس، فقال قاضي خان: وإن لم أعكس فقال أبو بكر: إن لم تعكس يرد على قول أبي يوسف كذا وكذا، ويرد على قول محمد كذا وكذا، وذكر عدة مسائل، فترك قاضي خان المنبر واعتنقه، وقال: يا سيدى! لعلك تكون محمد بن الفضل الكماري قال: نعم، فقال: أنت أحق بهذا المجلس منّى، ومات ببخارى سنة إحدى وسبعين وثلاثمائة" - انتهى -.

ثم تعقّب عليه اللكنوي قائلا: "هذه الحكاية التي حكاها من ملاقاته مع قاضي خان مما لا يمكن ='),
('fatawa-qazi-khan', 'تلامذته', 77, 'فتفقّه عليه أجلة العلماء وكبار الفقهاء الذين أصبحوا بعد ذلك أئمة في علوم الدين،  وفيما يلي أسوق تراجمَ الفقهاء البارزين من تلاميذه باختصار:

١ - طاهر بن أحمد بن عبد الرشيد بن الحسين، الإمام، افتخار الدين،  البخاري:

تلميذ قاضي خان وابن أخت عمّه، أخذ عن أبيه قوم الدين أحمد عن أبيه عبد الرشيد، وأيضًا أخذ عن حماد بن إبراهيم الصفار، وتفقّه على خاله ظهير الدين الحسن بن على المرغيناني، كما تفقّه على الإمام قاضيخان.

"كان عديم النظير في زمانه، فريد أئمة الدهر، شيخ الحنفية بما وراء النهر، من أعلام المجتهدين في المسائل"  حيث ذكره العلامة ابن كمال باشا من  "طبقة المجتهدين في المسائل"  الذين يقدرون على الاجتهاد في المسائل التي لا رواية فيها من صاحب المذهب  (١) .

وله تصانيف مقبولة، منها  "خلاصة الفتاوى"  و  "خزانة الواقعات"  و "النصاب" .  وقول العلامة اللكنوي:  "وقد طالعت من تصانيفه خلاصة الفتاوى، ذكر أنه لخّصه من الواقعات والخزانة، وهو كتاب معتبر عند العلماء معتمد عند الفقهاء  (٢) .

وذكر التميمي وحاجي خليفة أنه توفي سنة ٥٤٢ هـ بسَرْخَس ثم حمل إلى بخارى.

٢ - عبيد الله بن إبراهيم بن أحمد بن عبد الملك بن عمر بن عبد العزيز، ينتهي نسبه

= وقوعها، فإن وفاة قاضي خان وهو حسن بن منصور الفرغاني سنة اثنتين وتسعين وخمسمائة، كما مرّ عند ترجمته، وقد ذكره القارى أيضا في ترجمته، فهل يتصور ملاقاة من توفى سنة ٣٧١، فلعله نسى ما قدمت يداه، وأظن أن الملاقى لقاضى خان هو أبو بكر محمد بن محمد بن إبراهيم بن أحمد بن صاحب الترجمة المتوفى سنة ٥٤٩ على ما نقلناه من "الأنساب". "الفوائد البهية" ص ١٨٥. وانظر: "الجواهر المضية" ٣/ ٣٠١.

وهذه القصة تدل على تمام أدب قاضي خان مع المشايخ وتواضعه، وبعده عن الاستعلاء.

(١) "النافع الكبير لمن يطالع الجامع الصغير" لللكنوي ص ٩، و "الفوائد البهية" ص ٨٤.

(٢) انظر ترجمته في: "الجواهر المضية" برقم ٦٦٦، "الطبقات السنية" برقم ٩٩٧، "كتائب أعلام الأخيار" برقم ٤١٤، "كشف الظنون" ١/ ٧٠٢، ٧١٨، ٧٠٣، ٢/ ١٩٩٩، "مفتاح السعادة" ٢/ ٢٧٨، "الفوائد البهية" ص ٨٤.'),
('fatawa-qazi-khan', 'تلامذته', 78, 'إلى عُبادة بن الصامت، جمال الدين المحبوبي  (١) ، الإمام، المعروف بأبي حنيفة الثاني.

ولُد سنة ٥٤٦ هـ، وكان إماما كاملا معدوم النظير في زمانه، فَرد أوانه في معرفة المذهب والخلاف. قال الإمام الذهبي في  "العبر في خبر من غبر" :  "شيخ الحنفية بما وراء النهر، وأحد من انتهى إليه معرفة المذهب، أخذ عن أبي العلاء عمر بن بكر بن محمد الزرنجري عن أبيه شمس الأئمة، وتفقه أيضًا على قاضيخان الأوزجندي" .

وممّن تفقّه عليه ابنه أحمد والد تاج الشريعة صاحب  "الوقاية" ، وحافظ الدين الكبير محمد البخاري، وحميد الدين الضرير على بن محمد البخاري، وبهاء الدين محمد بن أحمد الاسبيجابي، والظهير أبو بكر أحمد بن علي البلخي وغيرهم.

له تصانيف منها:   "شرح الجامع الصغير" ، و  "كتاب الفروق" ، توفي ببخارى في جمادى الأولى سنة ٦٣٠ هـ  (٢) .

٣ - يوسف بن أحمد بن أبي بكر، الخاصِي  (٣) ، نجم الدين،  جمال الأئمة:

كان إمامًا فاضلا، أخذ عن أبي بكر محمد بن عبد الله من أقران عمر النسفي، وعن الصدر الشهيد حسام الدين عمر، وعن الحسن قاضي خان، جمع  "الفتاوى"  المشهورة، ورتّب  "فتاوى"  الصدر الشهيد و  "واقعاته" .

وحكى اللكنوي عن القارى أنه كان في أوائل المائة السادسة، وأن له  "الفتاوى"  و  "مختصر الفصول" ، وذكر حاجي خليفة وفاته عند ذكر  "الفصول في الأصول"  سنة أربع وثلاثين وستمائة  (٤) .

(١) "المحبوبي": نسبة إلى محبوب بن الوليد بن عبادة بن الصامت، أحد أجداده. انظر "الفوائد البهية" ص ١٠٨.

(٢) انظر ترجمته في: "العبر" للذهبي ٢٣/ ١١٢، "دول الإسلام" للذهبي ٢/ ١٣٥، "الجواهر المضية" برقم ٨٩١، "الطبقات السنية" برقم ١٣٦٢، "الفوائد البهية" ص ١٠٨، "كتائب إعلام الأخيار" برقم ٣٩٥، "شذرات الذهب" ٥/ ١٣٧.

(٣) "الخاصي": نسبة إلى الخاص، قرية من قرى خوارزم، "الفوائد البهية" ص ٢٢٦.

(٤) انظر ترجمته في: "الجواهر المضية" برقم ١٨٣١، "الطبقات السنية" برقم ٢٧١٤، "كشف ='),
('fatawa-qazi-khan', 'تلامذته', 79, '٤ - الإمام محمود بن أحمد بن عبد السيد بن عثمان بن نصر بن عبد الملك  (١) ، الملقّب بجمال الدين، المكنى بأبي المحامد، البخاري،  الشهير بالحَصيري:   (٢) .

وُلد ببُخارى سنة  (٥٤٦ هـ) . كان إمامًا فاضلا، انتهت إليه رئاسة المذهب في زمانه، تفقّه على الإمام قاضيخان الذي كان أجلّ الفقهاء في ذلك العصر وأشهرهم، فلازمه الحصيري خلال إقامته في بخارى وجعله أسوةً وسندًا في مجال الفقه الحنفي، وكان من تلامذته الخاصة حتى بلغ رتبة الكمال.

وبعد وفاة شيخه قاضي خان سنة ٥٩٢ هـ خرج من بخارى، فسمع صحيح مسلم وغيره بنيسابور من الإمام أبي الحسن المؤيد الطوسي، وسمع من الإمام المحدث أبي سعد الصفار النيسابوري الشافعي، والإمام منصور الفُراوي، وسمع بحلب من الإمام افتخار الدين الهاشمي، ثم توجّه إلى دمشق واستقرّ به.

ودرّس في المدرسة النورية بدمشق خمسا وعشرين سنة  (٣) ،  وتفقّه به طائفة كبيرة منهم:  الملك المعظم عيسى بن أبي بكر الأيوبي  (٦٢٣ هـ)  مصنف  "أصول الجامع الكبير" ، وصدر الدين الخِلاطي،  وسِبط:  ابن الجوزي، والإمام صدر الدين سليمان بن وهيب الأذرِعي صاحب  "منتخب شرح الزيادات"  الذي ألفه قاضي خان، والعلامة شهاب الدين الرازي، والعلامة مَجد الدين الموصلي، صاحب المتن المشهور  "المختار"  وشرحه

= الظنون" ٢/ ١٢٢٢، "الفوائد البهية" ص ٢٢٦، "تاج التراجم" برقم ٣٩١.

(١) انظر ترجمته في: "تكملة إكمال الإكمال في الأنساب والأسماء والألقاب، لابن الصابوني ص ١٢٧، ١٢٨، سير أعلام النبلاء ٢٣/ ٥٢. الجواهر المضية برقم ١٦١١، الطبقات السنية برقم ٢٤١٩، الفوائد البهية ص ٢٠٥، كتائب أعلام الأخيار برقم ٤١٧، طبقات الفقهاء لطاش كبري زاده ص ١٠٧، التكملة لوفيات النقلة ٦/ ٢٨٨، تذكرة الحفاظ ٤/ ١٤٢٥، العبر ٥/ ١٥٢، النجوم الزاهرة ٦/ ٣١٣، شذرات الذهب ٥/ ١٨٢، كشف الظنون ١/ ٥٦٣، ٥٦٨، ٧٢٧.

(٢) "الحَصِيري": بفتح الحاء، نسبة إلى محلّة ببخارى ينُسج بها الحَصير. "تاج التراجم" ص ٦٩، "تكملة إكمال الإكمال" ص ١٢٨، "سير أعلام النبلاء" ٢٣/ ٥٣.

(٣) "العبر في خبر من عبر" للذهبي، ٣/ ٢٢٨.'),
('fatawa-qazi-khan', 'إجازة قاضيخان للحصيري', 80, '"الاختيار" . وكثيرون، وروى عنه الحديث جمال الدين الحافظ ابن الصابوني صاحب  "تكملة إكمال الإكمال" ، والقاضي تقي الدين سليمان الحنبلي وغيرهم.

شغَف بكتب الإمام محمد وروايتها،  ومن تصانيفه:  شرح الجامع الصغير، وشرح السير الكبير، والطريقة الحَصيرية في علم الخلاف بين الشافعية والحنفية، وخير مطلوب في العلم المرغوب، والنجم الهادي الساري إلى حلّ ألفاظ صحيح البخاري، والوجيز شرح الجامع الكبير  (١) ، والتحرير شرح الجامع الكبير  (٢) ، سلَك فيهما نهجَ شيخه قاضي خان في  "شرح الزيادات"  من التأصيل والتقعيد.

كان جمال الدين الحصيري من أبرز تلاميذ قاضيخان، وكثيرا ما ينقل آراء شيخه في مواضع من كتابه  "التحرير"  فيقول:  "قال أستاذنا الإمام قاضيخان"   (٣) .

[إجازة قاضيخان للحصيري]

كان الإمام الحصيري موضع الثقة عند شيخه، اعترف له بالنبوغ والإمامة،  تدل على ذلك الإجازة الآتية التي منحها شيخه قاضي خان:

"يقول المحتاج إلى رحمة الله تعالى وغفرانه،  الشاكر لفضله وإحسانه:  الحسنُ بن منصور بن محمود الأوزجَنْدي: قرأ عليّ كثيرًا من الكتب التي ألّفها علماء الإسلام وصدور الأنام في تمهيد قواعد الفقه والأحكام، وتمييز الحلال من الحرام، منها ما رواه محمد عن أبي يوسف عن أبي حنيفة رحمهم الله تعالى نحو المبسوط والجامع الصغير ومنها من اختص بتأليفها محمد رحمه الله تعالى نحو الجامع الكبير والسير الكبير والزيادات، وقد يسر الله تعالى على الشيخ الإمام الجليل الزاهد جمال الدين زين الأنام

(١) ويحقّقه الباحث الأخ الفاضل حميد قائد سيف كرسالته للدكتوراة من المعهد العالي للقضاء، جامعة الإمام محمد بن سعود الإسلامية بالرياض.

(٢) استخلص منه القواعد والضوابط الفقهية الأستاذ الدكتور علي أحمد الندوي، وقدّم له بدراسة وافية، ونال به درجة الدكتوراة بامتياز من جامعة أم القرى بمكة المكرمة.

(٣) "التحرير شرح الجامع الكبير" مخطوط، ق ١/ ٢٧٣.'),
('fatawa-qazi-khan', 'إجازة قاضيخان للحصيري', 81, 'محمود بن أحمد بن عبد السيد قراءة عامّتها، وإحكام صورها ومبانيها، والوقوف على حقائقها ومعانيها، فبلّغه درجة الإفتاء والدراسة، وارتقى مرقاة الشرف والرئاسة، متّعه الله تعالى بما أعطاه وجعل الجنة مأواه؛ كتبت هذه الأسطر رجاء أن يذكرني بالدعاء الصالح. فإنه أحسن مسئول وأنفس مأمول "  (١) .

ثم أضاف إلى ذلك التميمي:  " ورأيت أيضًا على ظهر النسخة المذكورة بخط الحصيري ما صورته: قال مولانا وسيدنا القاضي الإمام الأجل الأستاذ قاضي القضاة فخر الملة والدين ركن الإسلام والمسلمين، بقية السلف، أستاذ الخلف، مفتي الشرق والصين أبو المفاخر الحسن بن منصور بن محمود بن عبد العزيز متّع الله الإسلام والمسلمين بطول بقائه  (٢) .

"وهذه الإجازة بمثابة تزكية من الإمام قاضيخان لتلميذه النابغة الحصيري، وإنها شهادة إمام خبير لتلميذ نبيه، ويُعَدّ مثل هذا التلميذ عنوان مجد ووسام فخر لأستاذه أيضًا، ثم تعليق الحصيري على الشهادة المذكورة، فيه إشارة واضحة إلى مدى علاقته بأستاذه والاعتراف بعظيم مناقبه"   (٣) .

توفي الحَصيري في صفر سنة ٦٣٦ هـ، وله تسعون سنة،  قال الذهبي:   "ازدحم الخلق على نَعشه وحمَله الفقهاء على الرءوس، وكان يوما مشهودا"   (٤) .

٥ - محمد بن عبد الستار بن محمد، المعروف بشمس الأئمة، الكَردري  (٥) :

ولد سنة تسع وخمسين وخمسمائة، وقرأ بخوارزم على الشيخ برهان الدين ناصر المطرّزي صاحب  "المغرب" ، ثم رحَل لطلب العلم إلى ما وراء النهر، وتفقّه بسمرقند

(١) "الطبقات السنية"، رقم الترجمة ٢٤٢٠.

(٢) المصادر السابقة.

(٣) "القواعد والضوابط المستخلصة من التحرير" للدكتور علي أحمد الندوي، ص ٤٥.

(٤) سير أعلام النبلاء ٢٣/ ٥٤، "تاريخ الإسلام" للذهبي ج ١٧ ترجمة الحصيري.

(٥) نسبة إلى الجدّ المنتسب إليه، وكَرْدَر بفتح أوله ثم السكون، ناحية من أعمال جُرجانية خوارزم.

"الجواهر المضية" ٣/ ٢٢٨، و"معجم البلدان" ٤/ ٥١٠.'),
('fatawa-qazi-khan', 'إجازة قاضيخان للحصيري', 82, 'وبخارى على مشايخ منهم:  القاضي عماد الدين عمر الزرَنْجَرى، وقوام الدين الصفّار، وشرف الدين العقيلي، ونور الدين الصابوني، والإمام زين الدين أحمد العتّابي، وأجلّ أساتذته فخر الدين قاضيخان، وصاحب الهداية على بن أبي بكر المرغيناني.

برع في العلوم، وفاق على أقرانه،  وأقر له بالفضل والتقدم أهل زمانه حتى قيل:  إنه أحيا علم الفروع وأصوله بعد أبي زيد الدبوسي،  "كان أستاذ الأئمة على الإطلاق، والموفود إليه من الآفاق" ، وتفقّه عليه خلق كثير، منهم ابن أخته العلامة محمد بن محمود بن عبد الكريم المعروف بالإمام خواهرزاده، وحميد الدين الضرير على الرامُشي، وحافظ الدين محمد بن محمد بن نصر البخاري وغيرهم.

مات ببخارى يوم الجمعة تاسع المحرم سنة اثنتين وأربعين وستمائة  (١) .

٦ - صدر الإسلام طاهر بن برهان الدين محمود صاحب  "المحيط البرهاني"  بن تاج الدين الصدر السعيد أحمد بن برهان الدين الكبير عبد العزيز بن عمر بن مازه.

كان من أعيان الفقهاء الحنفية، له اليد الطولى في الفروع والأصول، ومشاركة تامّة في المعقول والمنقول، أخذ عن أبيه صاحب المحيط، كما تفقّه على فخر الدين قاضي خان.

ومن تصانيفه:   "الفوائد"  و  "الفتاوى"   (٢) .

٧ -  نجم الأئمة الحكيمي:

لم أجد اسمه ونسبه في كتب التراجم، إنما ذكر القرشي والكفوي أنه تلميذ قاضي خان، وأستاذ ركن الدين الوالجاني الخوارزمى الذي كان إمامًا جليلا كثير العلم، والذي تفقّه عليه صاحب  "القنية"   (٣) .

(١) انظر ترجمته في: "سير أعلام النبلاء" ٢٣/ ١١٢، "الجواهر المضية" برقم ١٣٧٧، "الطبقات السنية" برقم ٢٠٩٥، "الوافي بالوفيات" ٣/ ٢٥٤، "تاج التراجم" برقم ٢٤٦، "هدية العارفين" ٢/ ١٢٢، "الفوائد البهية" ص ١٧٦، "كتائب أعلام الأخيار" برقم ٤١٨.

(٢) ترجمته في: "تاج التراجم" برقم ١٢٤ ص ١١٠ و "الفوائد البهية" ص ٨٥.

(٣) ترجمته في: كتاب الألقاب من "الجواهر المضية" برقم ٢١٠٤ ج ٤/ ٤٤١، "الطبقات السنية" برقم ٣٠٢٦، "كتائب أعلام الأخيار" برقم ٤١٦ "الفوائد البهية" ص ٢٢٠.'),
('fatawa-qazi-khan', 'سند الإمام قاضي خان في الفقه', 83, '[سند الإمام قاضي خان في الفقه]

ذكر الحافظ القُرشي في ترجمة أحمد بن إبراهيم بن عبد الغني بن أبي إسحاق، السروجي  (٧١٠ هـ)  سندَه في الفقه الذي يحتوي على سند الإمام قاضي خان أيضا فقال:

"قرأ على الإمام أبي الربيع صدر الدين سليمان، عن الشيخ جمال الدين محمود الحصيري … عن الإمام فخر الدين الحسن بن منصور قاضي خان، عن الإمام ظهير الدين الحسن بن علي بن عبد العزيز المرغيناني، عن الإمام سراج الأئمة برهان الدين عبد العزيز بن مازة، وشمس الدين محمود جدّ قاضي خان، كلاهما عن شمس الأئمة السرخسي، عن الإمام أبي محمد عبد العزيز الحلواني، عن أبي علي الحسن بن خضر النسفي، عن الإمام أبي بكر محمد بن الفضل البخاري، عن عبد الله بن أبي حفص، عن أبيه أبي حفص الكبير، عن محمد بن الحسن، عن الإمام أبي حنيفة"   (١) .

[منزلة قاضي خان بين الفقهاء الحنفية وثناء العلماء عليه]

احتل الإمام قاضي خان مكانة مرموقة بارزة بين الفقهاء الحنفية، تتجلّى منزلته بوضوح من حيث إن الذين كتبوا في  "طبقات الفقهاء الحنفية"   (٢)  من المحقق ابن كمال باشا  (ت ٩٤٠ هـ) ، وعصام الدين أبو الخير طاش كبري زاده  (ت ٩٦٨ هـ) ، والعلامة ابن عابدين  (ت ١٢٥٢ هـ) ، والعلامة عبد الحي اللكنوي  (٣) ، اتفقت كلمتهم على أن الإمام قاضيخان

(١) "الجواهر المضية" ١/ ١٢٥ - ١٢٦.

(٢) يقول العلامة اللكنوي في أهمية معرفة طبقات الفقهاء: "وهذا أمر لا بد للمفتى من معرفته لينزل الناس منازلهم، ويضعهم في مواضعهم، فإن من لا يعرف مراتب الفقهاء ودرجاتهم يقع في الخبط بتقديم من لا يستحق التقديم، وتأخير من يليق بالتقديم، وكم من عالم من علماء زماننا ومن قبلنا لم يعلم بطبقات فقهاءنا، فرجح أقوال من هو أدنى، وهجر تصريحات من هو أعلى" "النافع الصغير" ص ٥.

(٣) جعلل المحقق ابن كمال باشا الفقهاءَ الحنفية سبعَ طبقات، وذلك في رسالته المسمّاة "طبقات الفقها"، مخطوطة في معهد الدراسات الإسلامية العليا ببغداد، ذكر ذلك دكتور محمد عبد اللطيف الفرفور في "الوجيز في أصول الاستنباط" ص ٥٣٤.'),
('fatawa-qazi-khan', 'منزلة قاضي خان بين الفقهاء الحنفية وثناء العلماء عليه', 84, 'من  "طبقة المجتهدين في المسائل"  الذين يجتهدون في المسائل التي لا رواية فيها عن صاحب المذهب، ومن هذه الطبقة الإمام الخصاف، والإمام الطحاوي، وأبو الحسن الكرخي، وشمس الأئمة الحلواني، وشمس الأئمة السرخسي، وفخر الإسلام البزدوي. وهذه الطبقة أعلى طبقة الفقهاء بعد طبقة المجتهدين في المذهب من أبي يوسف ومحمد بن الحسن وزفر وحسن بن زياد، وهذه الطبقة تميزت بخدمة الفقه الحنفي، ووضعت الأسس لنموه والتخريج والبناء على أقواله، كما وضعت أسس الترجيح فيه والمقايسة بين الآراء وتصحيح بعضها وتضعيف الآخر.

وهؤلاء الفقهاء،  عملهم في الحقيقة يتكوّن من عنصرين على حد تعبير الشيخ أبي زهرة:

أحدهما:  استخلاص القواعد العامّة التي كان يلتزمها الأئمة من الفروع المأثورة عنهم، فإنهم جمَعوها في قواعد وضوابط، واعتبروها الأصل الذي كان على أساسه الاستنباط، وكان مقاس الاستخراج السليم للأحكام الفقهية.

ثانيهما:  استنباط الأحكام في المسائل التي لا نصّ فيها عن أئمة المذهب على حسب أصول قرّروها ومقتضى قواعد بسطوها  (١) .

ولقد نهَج الإمام قاضي خان على هذا النمط في مؤلفاته، خاصة في  "الفتاوى"  وفي

= وقد اعتمد كثير من العلماء تقسيم ابن كمال ياشا، فذكره عصام الدين طاش كبري زاده في مقدمة كتابه "طبقات الفقهاء" ص ٧ - ١٠ وفقَ ما جاء في كلام ابن كمال باشا، دون تعليق أو تغيير، ثم أعاد نصّها ابن عابدين في رسالته: "شرح عقود رسم المفتي" ١/ ١١، ١٢ من رسائل ابن عابدين، وفي كتابه "ردّ المحتار" ١/ ٧٧، كما ذكره العلامة اللكنوي في مقدمة "الفوائد البهية" ص ٦، و"النافع الكبير لمن يطالع الجامع الصغير" ص ١٠، ١١ مع بعض الملاحظات. وقد وجّه إلى هذا التقسيم وترتب الطبقات وتوزيع الفقهاء عليها نقدٌ من قبل بعض العلماء إلا أنه خارج عن موضوعنا ولا يقدح ما ذكرنا، وقد فصّله الدكتور يعقوب بن عبد الوهاب الباحسين خير تفصيل في كتابه "التخريج عند الفقهاء والأصوليين" فليرجع ص ٣٠١ - ٣١٠.

(١) "أبو حنيفة" للشيخ محمد أبي زهرة، بتصرف واختصار ص ٤٤٢.'),
('fatawa-qazi-khan', 'تصحيح قاضي خان معتمد ومقدم', 85, '"شرح الزيادات" ، وله آراء وترجيحات مديدة معتمدة عند الفقهاء المتأخرين الذين أكثروا النقلَ عنه.

ثناء العلماء عليه:  احتل الإمام قاضي خان مكانة علمية بارزة بين الفقهاء الحنفية، فأشادوا بذكره، وأثنوا عليه ولقبوه بألقاب فخمة.

يذكره الإمام الحصيري معترفا بمناقبه وفضله بقوله:   "قال مولانا وسيدنا القاضي الإمام الأجل الأستاذ قاضي القضاة فخر الله والدين ركن الإسلام والمسلمين، بقيّة السلف، أستاذ الخلف، مفتي الشرق والصين أبو المفاخر الحسن بن منصور بن محمود بن عبد العزيز متّع الله الإسلام والمسلمين بطول بقائه"   (١) .

يقول كمال الدين بن الفوطي الشيباني الحنبلي في ترجمته:   "من القضاة الفضلاء والرواة النبلاء"   (٢) .

وقال ابن العماد الفقيه المؤرخ والأديب الحنبلي في ترجمته:   "الإمام الكبير بقية السلف مفتي الشرق من طبقة المجتهدين في المسائل"   (٣) .

وقال ابن عابدين الشامي:   "لا يعدل عن تصحيح قاضي خان فإنه فقيه النفس"   (٤) .

[تصحيح قاضي خان معتمد ومقدم]

الذي يزيد منزلة قاضي خان العلمية وثقته ومكانته الفقهية ويؤيّد ما سبق أننا نرى أن كبار الفقهاء المتأخرين من أصحاب المتون والشروح والفتاوى، من ابن الساعاتي، وكمال الدين بن الهمام، وأكمل الدين البابرتي، والعلامة بدر الدين العيني، وابن نجيم، وفخر الدين الزيلعي، والإمام محمد بن محمود الأستروشني، وقاسم ابن قطلوبغا، وخير الدين الرملي، ومحمد بن عبد الله التُمُرتاشي، وعلاء الدين الحصكفي، والعلامة ابن عابدين،

(١) "الطبقات السنية"، رقم الترجمة ٢٤٢٠.

(٢) "تلخيص مجمع الآداب" لابن الفوطي ٢/ ١٥٣.

(٣) انظر "شذرات الذهب" لابن عماد ٤/ ٣٠٨.

(٤) "حاشية ابن عابدين" ٤/ ٥١٣.'),
('fatawa-qazi-khan', 'تصحيح قاضي خان معتمد ومقدم', 86, 'وصاحب  "الفتاوى التتارخانية"  وأصحاب  "الفتاوى الهندية"  وغيرهم، كلهم يعتمدون على أقواله، وتصحيحه وترجيحه للروايات.

يقول مظفر الدين بن الساعاتي  (٦٥١ - ٦٩٤ هـ)  في  "شرح مجمع البحرين"  عند اختياره تصحيح قاضي خان في مسألة غسل اللحية في الوضوء:  "والأصح من الرواية ما نصّ عليه قاضي خان رحمه الله في شرح الجامع الصغير أن الفرض هو مسح ما يلاقي البشرة من الوجه .. "   (١) .

وقال العلامة قاسم بن قُطلوبُغا  (ت ٨٧٩ هـ)   (٢)  في مقدمة كتابه القيّم  "الترجيح والتصحيح على القدوري" :  "وهذا ما تيسّر لي على مختصر القدوري مع زيادات نصّ على تصحيحها القاضي الإمام فخر الدين قاضي خان في فتاواه، فإنه من أحقّ أن يعتمد على تصحيحه، والله ولي الإعانة وهو حسبي ونعم الوكيل"   (٣) .

وقال في موضع آخر:   "ما يصحّحه قاضي خان مقدّم على تصحيح غيره، لأنه فقيه النفس"   (٤)

ونقله العلامة ابن عابدين وأيّده، وأضاف عليه في مؤلفاته الشهيرة، قال في  "شرح عقود رسم المفتي" :

"وإن كان كل منهما بلفظ الأصح أو الصحيح، فلا شبهة في أنه يتخير بينهما إذا كان

(١) "شرح مجمع البحرين" لابن الساعاتي، تحقيق صالح بن عبد الله بن صالح اللحيدان، ١/ ٥٦، رسالة دكتوراة، المعهد العالي للقضاء، جامعة الإمام محمد بن سعود الإسلامية.

(٢) هو العلامة قاسم بن قطلوبغا من تلامذة الحافظ ابن حجر العسقلاني وابن الهمام صاحب "فتح القدير وغيرهما، إمام علامة قوى المشاركة في الفنون، تصانيفه تزيد على السبعين في الفقه والحديث وغيرهما، ذكرها شمس الدين السخاوي في الضوء اللامع في أعيان القرن التاسع، مات سنة تسع وسبعين وثمان مائة. انظر النافع الكبير ص ١٣.

(٣) "تصحيح القدوري" مخطوط، لوحة ٥، شريط مصور في المكتبة المركزية، جامعة الإمام محمد بن سعود الإسلامية، تحت رقم ٤٠٥٠، عن مكتبة تشستربيتي بايرلندا.

(٤) مقدمة "تصحيح القدوري" ق ١، والنافع الكبير ص ١٣.'),
('fatawa-qazi-khan', 'تصحيح قاضي خان معتمد ومقدم', 87, 'الإمامان المصححان في رتبة واحدة، أما لو كان أحدهما أعلم فإنه يختار تصحيحه، كما لو كان أحدهما في  "الخانية" ، والآخر في البزازية مثلا، فإن تصحيح قاضي خان أقوى،  فقد قال العلامة قاسم:  إن قاضي خان من أحق من يعتمد على تصحيحه "  (١) .

وذكر في مسائل الخلع من حاشيته على " الدر المختار ":

" وقول الشارح أوّل الباب خلافا للخانية، تَبِعَ قولَ البحر، وإن صرّح قاضي خان بخلافه، ولم يظهر لي وجه ترجيح التصحيح الأول على الثاني مع أنهم قالوا إن قاضي خان بن أجلّ مَن يُعتمد على تصحيحه  (٢) .

ونقل ابن عابدين عن خير الدين الرملي:   "وفي حاشيته للرملي بعد كلام نقله عن " الخانية " … وقد ذكر المسألة في جواهر الفتاوى، وذكر اختلافا كثيرا واختلاف تصحيح، ولكن عليك بما في " الخانية "، فإن قاضي خان من أهل التصحيح والترجيح. انتهى"   (٣) .

وفي مسائل قبض الهبة عن الصغير نرى أن ابن عابدين رجّح قول قاضي خان على قول صاحب الهداية وصاحب البدائع،  فقال:

"فقد علمتَ أن " الهداية " و" الجوهرة " على تصحيح عدم جواز قبض مَن يَعوله مع عدم غيبة الأب، وبه جزَم صاحب " البدائع "، وقاضي خان وغيرُه من أصحاب الفتاوى صَحّحوا خلافَه،  وكن على ذكر مما قالوا:  لا يعدل عن تصحيح قاضي خان فإنه فقيه النفس، ولا سيما وفيه هنا نفع للصغير، فتأمل عند الفتوى"   (٤) .

فما نوّه به ابن عابدين ولقبه بأنه  "فقيه النفس"  يعتبر شهادة فقيه، خبيرٍ بكمّ هائل من

(١) "شرح عقوب رسم المفتي"، الرسالة الثانية في "مجموعة رسائل ابن عابدين" ١/ ٣٩، طبع دار سعادت محمد هاشم الكتبي ١٣٢١ هـ.

(٢) "حاشية ابن عابدين" ٢/ ٥٦٥، دار إحياء التراث، مصور عن طبع بولاق.

(٣) انظر "حاشية ابن عابدين" ٤/ ٢٤٨.

(٤) "حاشية ابن عابدين" ٤/ ٥١٣، وكذلك نجد اعتماد ابن عابدين على تصحيح قاضي خان في كتاب الحجر ٥/ ٩٣، و ١/ ٤٤٥، وأمثلة ذلك كثيرة.'),
('fatawa-qazi-khan', 'مؤلفات الإمام قاضي خان', 88, 'تراث الفقهاء، والذي يعتبر خاتم المحققين في الفقه الحنفي.

أما تعريف  "فقيه النفس" :  "فهو الذي صار الفقه سَجِيّة ملازمة له، وملكة قائمة به، يستطيع بواسطتها استنباط الأحكام وإدراكها"   (١) .

"والمقصود بذلك أن يكون شديد الفهم بالطبع لمقاصد الكلام، أي أن يكون له استعداد فطري يؤهّله للاجتهاد"   (٢) .

وعدّ إمام الحرمين الجُويني وجلال الدين المحلي من شروط المجتهد أن يكون فقيهَ النفس  (٣) . واعتبر الجويني هذا رأسَ مال المجتهد،  وقال:  إنه أمر جبلّي، ولا يتأتّى كسبه وتحصيله بحفظ الكتب  (٤) .

[مؤلفات الإمام قاضي خان]

خلَف الإمام قاضي خان ثروة علمية كبيرة للمكتبة الإسلامية، تدل على مكانته العلمية العالية في الفقه، واطّلاعه الواسع على دقائق المذهب الحنفي، وقد نسبت كتب التراجم إليه طائفة من الكتب، كانت موضع اهتمام الفقهاء المتأخرين الذين أكثروا النقل عنه والإحالة إليها، ولكنها مغمورة مع جلالة قدرها، سِوى فتاواه الشهرة، بعضها ما تزال مخطوطة يمكن الوقوف عليها، وبعضها لا نعلم له مكانا،  وفيما يلي أذكر نبذة يسيرة عن مؤلفاته القيّمة:

١ -  " فتاوى قاضي خان"  أو  "الفتاوى الخانية" :

من الفتاوى المعتمدة في المذهب الحنفي، ومن كتب الفتاوى التي نالت أسمى مكانة

(١) "الوجيز في أصول التشريع الإسلامي" للدكتور محمد حسن هيتو، ص ٤٩٦.

(٢) "التخريج عند الفقهاء والأصوليين" للدكتور يعقوب بن عبد الوهاب الباحسين، ص ٣٢٤.

(٣) انظر "البرهان" للجويني ٢/ ١٣٣٢، و"جمع الجوامع" سرح الجلال المحلى، ٢/ ٣٨٢.

(٤) "البرهان" للجويني ٢/ ١٣٣٢.'),
('fatawa-qazi-khan', 'فتاوى قاضي خان أو الفتاوى الخانية', 89, 'في الإفتاء، وتداولتها أيدي الفقهاء في كل زمان ومكان، لأنه احتوى على المسائل التي يغلب وقوعها وتمسّ الحاجة إليها بدون التعرض للفروض النادرة.

وبجانب ذلك نرى أن الإمام قاضي خان يسلك فيه مسلك الترجيح عند تعدّد الروايات من أئمة المذهب المتقدمين وكثرة الأقاويل من المتأخرين، وكلّ ذلك جعل هذه المجموعة الطيبة المختارة من الفتاوى تحوز القبول والاعتماد لدى العلماء  (١) .

يقول حاجي خليفة في بيان وصفه وأهمّيته:   "هي مشهورة، مقبولة، معمول بها، متداولة بين أيدي العلماء والفقهاء، وكانت هي نصبَ عين من تصدّر للحكم والإفتاء" .  (٢)

ووصفها العلامة اللكنوي بقوله:   "وله الفتاوى المشهورة المتداولة … انتفعت بفتاواه، وهي في أربعة أسفار معتمدة عند أجلّة الفقهاء،  حتى قال قاسم بن قطلوبغا في تصحيح القدوري:  ما يُصحّحه قاضي خان مقدم على تصحيح غيره  (٣) ؛ لأنه فقيه النفس"   (٤) .

أما طريقته وترتيبه ومنهجه الذي وضعه المؤلف نُصبَ عينيه في الفتاوى،  فخير ما عبّره هو نفسه في فاتحة الكتاب قائلا:

"ذكرتُ في هذا الكتاب من المسائل التي يغلب وقوعُها وتمسّ الحاجة إليها، وتدور علميها واقعات الأمّة، ويقتصر عليها رغبات الفقهاء والأئمة،  وهي أنواع وأقسام:  منها ما هي مروية عن أصحابنا المتقدمين، ومنها ما هي منقولة عن المشائخ المتأخرين رضوان الله عليهم أجمعين، ورتّبتُه ترتيبَ الكتب المعرفة.

(١) "القواعد والضوابط المستخلصة من التحرير" ص ١٤٨.

(٢) "كشف الظنون" ٢/ ١٢٢٧.

(٣) ينظر ترجيح وتصحيح قاضي خان في فتاواه مثلا: ١/ ١٨، ٢٢، ٢٤، ٣٥، ٢٠٦، ٢١٤، ٢١٥، ٢٤٠، ٢٦٩، ٢٧٨، ٣٠٧، ٣٢٨، ٣٣٥، ٣٣٦، ٣٥٠، ٣٥٤، ٣٧٧، ٤٢٢، ٤٢٧، ٤٣٢، ٤٥١، ٥٣٠، ٥٣٦، ٥٤٢.

(٤) "الفوائد البهية" ص ٦٤.'),
('fatawa-qazi-khan', 'فتاوى قاضي خان أو الفتاوى الخانية', 90, 'وجعلتُ لكل جنسٍ فصلا، وبيّنتُ لكل فرع أصلا، وفيما كثُرَتْ فيه الأقاويل من المتأخرين اقتصرتُ فيه على قول أو قولين، وقدّمتُ ما هو الأظهَر وافتتحت بما هو الأشهَر، إجابةً للطالبين وتيسيرا على الراغبين، وعلى الله توكلت فيما تمنيت، واستعصمتُه عن الخطأ فيما نويت، وهو حسبي ونعم الوكيل، وعليه أتوكّل وبه أستعين "  (١) .

وذكر حاجي خليفة في كشف الظنون تاريخ تصنيفه:  قيل افتتح بإملائه يوم الأربعاء، وقت الظهر، العاشر من محرم، سنة ثمان وسبعين وخمسمائة  (٢) .

وقد طبع هذا الكتاب قديما طبعة حجرية في كلكته بالهند، في أربعة أجزاء، سنة ١٨٣٥ م - ١٢٥١ هـ، ثم أعيد طباعته بهامش " الفتاوى الهندية " في مصر بدار الطباعة العامرة ببولاق، سنة ١٣١٠ هـ، وبهامش " الفتاوى السراجية "  (٣) ، وما زال هذا الكتاب القيّم بحاجة إلى خدمة علميّة وإعادة نشر في حُلة جديدة لتتيسّر الاستفادة منه  (٤) .

ونظرا إلى عظم أهمية الكتاب وشهرته العلمية، اهتم بعض العلماء باختصاره وتلخيصه،  منها:

- " مختصر قاضي خان " للشيخ محمد بن مصطفى بن الحاج محمد افندى:

أشار إليه حاجي خليفة بقوله:  " وقد رتّب رجل من علماء الروم مسائله يقال له محمد وهو محمد بن مصطفى بن الحاج محمد افندي،  وأوله:  الحمد لله الذي هدانا لهذا وما كلنا لنهتدي لولا أن هدانا الله النسخ، ذكر فيه أنه أشار إليه شيخه المولى محمد ابن شيخ الإسلام محمد الشهير بجوي زاده سنة ٩٩٥ هـ بترتيبه فرتّبه وسمّاه  "وهاج الشريعة"   (٥) .

(١) "فتاوى قاضي خان" ١/ ٢.

(٢) "كشف الظنون" ٢/ ١٢٢٧.

(٣) انظر "معجم المطبوعات العربية والمعرّبة" جمع وترتيب يوسف اليأن سركيس، ٢/ ١٤٨٧. مكتبة الثقافة الدينية، الظاهر، مصر.

(٤) ومن أماني الغالية خدمة هذا الكتاب القيم، عما قريب - إن شاء الله - أدعو الله العليّ القدير التوفيق والرشاد وحسن الإخلاص.

(٥) "كشف الظنون" ٢/ ١٢٢٧.'),
('fatawa-qazi-khan', 'فتاوى قاضي خان أو الفتاوى الخانية', 91, 'وقد اطلعت على هذا المخطوط أثناء زيارتي لمكتبة مراد ملا في إستنبول، والمختصر في ١٢٤ ورق، تحت رقم ١١٨٨، وهو كتاب نفيس قيّم،  أوضح المؤلف منهجه في المقدمة قائلا:

"ألفيت كتاب الفتاوى للإمام، الجليل الشأن، فخر الدين قاضي خان، أسكنه الله بحبوحة الجنان، محيطا بالمسائل الصحيحة المهمّة، حاويا على الأقوال القويّة من الأثر، ومنبّها على ما عليه الاعتماد من روايات المتقدمين والمتأخرين رضوان الله عليهم أجمعين، فانتخبت منه المسائل التي نبّه فيها على ما هو الأصح والأقوى، وعليه الاعتماد والفتوى، وما ذكره على هذا الوجه في غير بابه وفصلِه نقلتُه إلى محلّه مطابقا لأصله، تسهيلا على راغبين في أخذه ووصله،  وميّزته بأن أقول في ابتدائه:  ذكر المصنف رحمه الله،  وفي انتهائه:  انتهى، وأشرتُ إلى المواضع المنقول عنها، وأسأل الله تعالى أن يجعله خالصا لوجهه الجميل، إنه حسبي ونعم الوكيل. كتاب الطهارة .... "  وجاء في آخره:  "وقع الفراغ عن انتخابه وتنميقه بفضل الله تعالى وحسن توفيقه يوم الجمعة المبارك، الثامن والعشرين من شوال المكرم سنة ١٠٦٩ هـ"   (١) .

-  "محكمة السلطان مختصر قاضي خان" :

تأليف العلامة أبي أحمد أشرف بن يوسف أينال الطرازي، من علماء القرن الثامن، رأيتُ نسخة خطّية منه في مكتبة الأسد بدمشق، نسخت سنة ٧٠٦ هـ، في ٣٧٤ ورق، تحت رقم ٤٢٦،  أوّله:  الحمد لله الذي خفّف على عباده … كتاب الطهارة ".

وثبتت العبارة التالية على وجه الغلاف:  هذا الكتاب المحكم، هو المختصر من فتاوى قاضي خان، من تأليف الإمام الربّاني والحبر الهمداني العابد الزاهد التقي النقي الحاج الحرمين مولانا أشرف الحق في الدين، قدّس الله روحه ونوّر قبره.

- " مختصر قاضي خان" للمولى يوسف بن جنيد الشهير بأخي جلبي التوقاتي، في

(١) "مختصر قاضي خان" ورق ١، مكتبة مراد ملا، استنبول.'),
('fatawa-qazi-khan', 'شرح الجامع الصغير', 92, 'مجلد،  أوله:  الحمد لله الملك القوي المتين الخ، وأهداه إلى السلطان بايزيد خان  (١) .

٢ -  " شرح الجامع الصغير"   (٢) :

وهو من أجود الشروح للجامع الصغير الذي ألّفه الإمام محمد بن الحسن الشيباني، وعدّه طاش كبري زاده أحد الشروح السبعة المعتبرة. للجامع الصغير  (٣) ،  يقول القرشي عند بيان مؤلفاته مشيرا إلى حجمه:   "شرح الجامع الصغير في مجلدين كبيرين"   (٤) ، سار فيه الشارح على ترتيبه لأبي عبد الله الزعفراني.

منهجه من حيث الاستدلال وذكر الخلاف:

اعتنى الشارح رحمه الله بذكر أقوال الفقهاء والاستدلال لآرائهم، حيث يورد أقوال أئمة المذهب الحنفي وغيرهم في المسألة الخلافية، ويستدل لكل فريق باختصار، مع الجواب في بعض الأحيان عن دليل المخالف. والغالب على منهجه أن يذكر الرأي المختار أولًا، ثم رأي المخالف مع دليله، ثم دليل الرأي الأول المختار.

بيّن الشارح في مقدمته أهمّية الكتاب وما يحتوي عليه من مسائل،  وصحّة نسبته إلى الشيباني فقال:   "اعلموا وفقكم الله تعالى وإيّانا أنّ هذا الكتاب أصل جليل في الفقه، مشتمل على أمهات مسائل أصحابنا رحمهم الله،  حتى كان علي الرازي يقول:  من حفظ مسائلَ هذا الكتاب فهو من أحفظ أصحابنا، ومن فهمه فهو من أفهم أصحابنا، والمتقدمون كانوا لا يقلّدون القضاءَ لمن لم يحفظ مسائل هذا الكتاب.

ومسائله على ثلاثة أقسام:  قسم لا يوجد إلا في هذا الكتاب، وقسم هو معاد محض، وقسم ذكرها في " المبسوط" وأعادها ههنا بلفظ أخر وزيادة فائدة.

واختلفوا في تصنيف هذا الكتاب:  قال بعضهم: هو من تصنيف أبي يوسف،

(١) "كشف الظنون" ٢/ ١٢٢٧.

(٢) ينظر: "الطبقات السنية" ١٣/ ١١٧، "كشف الظنون" ١/ ٥٦٢، "مفتاح السعادة" ٢/ ٢٧٨، "الفوائد البهية" ص ٦٤، "تاج التراجم" للإمام قاسم بن قُطلوبُغا ص ٨٢.

(٣) "مفتاح السعادة" ٢/ ٦٠١.

(٤) "الجواهر المضية" ٢/ ٩٤.'),
('fatawa-qazi-khan', 'شرح الجامع الصغير', 93, 'ومحمد روى عنه،  وقال بعضهم:  من تصنيف محمد فإنه حين فرغ من تصنيف المبسوط، أمر، أبو يوسف أن يصنف كتابا، ويروي عنه، فصنف هذا الكتاب، وعرضه على أبي يوسف،  فقال أبو يوسف:  نِعمَ ما حفِظ عني أبو عبد الله، إلا أنه أخطأ في ثلاث مسائل،  فقال:  ما أخطأت ولكنك نسيتَ الرواية.

ومصنف هذا الكتاب جعل لكل كتاب بابا، ولم يرتّب مسائله، وإنما رتّبه الفقيه أبو عبد الله الحسن بن أحمد الزعفراني رحمه الله، فنحن نذكرها على الترتيب ترغيبا للمقتبسين وتيسيرا على الطالبين، فنقول وبالله نستعين ..  "  (١) .

وقد كان هذ الشرح مصدرا معتمدا عند الفقهاء، فيرجعون إليه ويقتبسون منه، فقد أحال إليه العلامة ابن نجيم في " البحر الرائق "  (٢) ، والعلامة الحصكفي في " الدر المختار "،  كما استفاد منه العلامة ابن عابدين وأشار إليه معلقا على ما ذكره الحصكفي بقوله:  " والذي رأيتُه في الشرح المذكور …  "  (٣) .

وتوجد لهذا الشرح نسخ خطية عديدة في مكتبات العالم، ذكر أماكنَها فؤاد سزكين  (٤) ، وأحتفظ بصورة من نسخة حلب تقع في مجلدين، واستفدت منها أثناء تحقيق " شرح الزيادات".

(١) "شرح الجامع الصغير" لقاضي خان، لوحة ٢، نسخة مصورة عن نسخة مدرسة الأحمدية بحلب في جزئين، محفوظة في المكتبة المركزية بجامعة الإمام محمد بن سعود الإسلامية، تحت رقم ٤٩١٧ و ٤٩١٥، عدد الأوراق ٣٣٩.

(٢) يقول ابن نجيم في كتاب الصلاة، أثناء شرح باب ما يفسد الصلاة وما يكره فيها: "كذا ذكره قاضي خان في "شرح الجامع الصغير" … وعلّل قاضي خان وجه كونه كثيرا بقوله: لأنه عمل اليد والفم واللسان … " انظر "البحر الرائق" ٢/ ١١.

(٣) انظر "ردّ المحتار على الدر المختار" كتاب الوكالة ٥/ ٥١٩.

(٤) "تاريخ التراث العربي" ٣/ ٦٩.

وقد سجّل الباحثان: أسد الله حنيف، وعبد العليم لاجوردخان تحقيق هذا الشرح كرسالة للدكتوراة في جامعة أمّ القرى بمكة المكرمة، فالحمد لله على ذلك.'),
('fatawa-qazi-khan', 'شرح الجامع الكبير', 94, '٣ -  " شرح الجامع الكبير" :

لم يذكره عامّة المترجمين له، وإنما ذكره إسماعيل باشا في مصنفات قاضي خان، كما عدّه حاجي خليفة من بين شروح  "الجامع الكبير"   (١) ، ولعل العلامة أبو الوفاء الأفغاني اعتمد عليهما فذكر قاضي خان في قائمة شرّاح  "الجامع الكبير"   (٢) .

والأمر الذي يؤكد أن الإمام قاضي خان. شَرحَ  "الجامع الكبير"  أنه أحال إليه في  "شرح الزيادات" ، في كتاب الإقرار،  بقوله:   "وقد ذكرنا هذا في الجامع الكبير"   (٣) .  يقصد:   "شرح الجامع الكبير"  كما هو صنيعه في الكتاب وغيره من الفقهاء.

ويغلب على الظن أنه لم يبق له أثر فلا نعرف عن وجوده من بين مكتبات العالم.

٤ -  " شرح الزيادات"   (٤) :

وهو الكتاب الذي نحن بصدد تقديمه وتحقيقه، وقد أفردت له بحثا خاصا في الفصل الثالث.

٥ -  " شرح أدب القاضي"  للخصاف:

ذكره حاجي خليفة وإسماعيل باشا وقاسم بن قُطلوبُغا وطاش كبري زاده في مؤلفات قاضي خان بهذا الاسم  (٥) ،  وذكره الكفوي واللكنوي بعنوان:   "شرح أدب القضاء للخصاف"   (٦) .

وكتاب  "أدب القاضي"  للإمام أحمد بن عمر بن مهير الشيباني، أبي بكر الخصّاف، المتوفي ٢٦١ هـ، كان إمامًا فاضلًا فارضًا حاسبًا، عارفًا بمذهب أصحابه، ورعًا

(١) انظر "هدية العارفين" لإسماعيل باشا البغدادي ٥/ ٢٨٠، "كشف الظنون" ١/ ٥٦٩.

(٢) انظر مقدمة الأستاذ أبي الوفاء الأفغاني على "الجامع الكبير" ص ٤.

(٣) راجع كتاب الإقرار ص ١٣٣٦.

(٤) "هدية العارفين" لإسماعيل باشا البغدادي ٥/ ٢٨٠، "كشف الظنون" ١/ ٩٦٢.

(٥) "كشف الظنون" لحاجي خليفة ١/ ٤٥، و "هدية العارفين" لإسماعيل باشا البغدادي ٥/ ٢٨٠، "تاج التراجم" للإمام قاسم بن قُطلوبُغا ص ٨٢، "مفتاح السعادة" ٢/ ٢٧٨.

(٦) "الفوائد البهية" ص ٦٥.'),
('fatawa-qazi-khan', 'شرح أدب القاضي للخصاف', 95, 'زاهدا يأكل من كسب يده، وقد تبوّأ منزلة كبيرة بين الفقهاء الحنفية، ونقل عنه الفقهاء المتأخرون كثيرا ودوّنوا آرائه في كتبهم،  وقال عنه شمس الأئمة الحلواني:   "الخصّاف رجل كبير في العلم، وهو ممّن يصحّ الاقتداء به"   (١) .

وعدّه العلامة ابن كمال باشا في الطبقة الثالثة، وهي  "طبقة المجتهدين في المسائل التي لا رواية فيها من صاحب المذهب" ، وهي الطبقة التي يعدّ منها الإمام قاضي خان أيضا، كما ذكرنا آنفا.

ويعتبر كتاب  "أدب القاضي"  الكتاب الجامع غاية ما في الباب ونهاية مآرب الطلاب، كما قال حاجي خليفة  (٢)  ومن الكتب الأوائل التي ألّفت في أدب القضاء،  يقول طاش كبري زاده:   "وأشهر التصانيف في علم القضاء " كتاب الخصاف"  (٣) .

ولذلك تلقّاه الأئمة بالقبول، وشرحه فحول أئمة الفروع والأصول، منهم الإمام أبو جعفر الهندواني  (٣٦٢ هـ) ، والإمام أبو بكر الجصاص  (٣٧٠ هـ)  والإمام أبو الحسن القدوري  (٤٣٨ هـ) ، وشيخ الإسلام علي السُعدي  (٤٦١ هـ) ، والإمام شمس الأئمة السرخسي  (٤٨٣ هـ) ، والإمام شمس الأئمة الحُلواني  (٤٥٦ هـ) ، والإمام أبو بكر المعروف بخواهر زاده  (٤٨٣ هـ) ، وبرهان الأئمة عمر بن عبد العزيز بن مازه الصدر الشهيد  (٥٣٦ هـ)  وهو المشهور المتداول اليوم من بين الشروح  (٤) ، والإمام فخر الدين قاضي خان  (٥٩١١ هـ)  وغيرهم  (٥) .

(١) "الطبقات السنية" ١/ ٤٨٥، "الجواهر المضية" ١/ ٢٣٢، "الفوائد البهية" ص ٣٠.

وقال العلامة الشيخ أبو الوفاء الأفغاني في مقدمة "كتاب النفقات" للخصّاف، ص ٥، بعد أن نقل هذا القول: "قلت: يروى نحو هذا عن قاضي خان"، أي يروى عنه في حق أبي بكر الخصاف.

(٢) "كشف الظنون" ١/ ٤٦.

(٣) "مفتاح السعادة" ٢/ ٦٠٠.

(٤) وقد طبع الكتاب أولا باعتناء العلامة أبي الوفاء الأفغاني والشيخ أبي بكر محمد الهاشمي، ثم طبعته وزارة الأوقاف ببغداد، في أربع مجلدات، بتحقيق محيي هلال السرحان، سنة ١٣٩٧ هـ.

(٥) انظر "كشف الظنون" ١/ ٤٦ - ٤٧.'),
('fatawa-qazi-khan', 'الأمالي في الفقه', 96, 'ومن الأسف أننا لا نقف على مكان وجود شرح قاضي خان بالاطلاع على فهارس المخطوطات ومكتبات العالم، ولقد نقل الإمام قاضي خان عن الخصاف ودوّن آراءه في مؤلفاته الأخرى، خاصة في شرح الزيادات وشرح الجامع الصغير وفتاواه الشهيرة.

٦ -  " الأمالي في الفقه" :

ذكره الكفوي واللكنوي وإسماعيل باشا بهذا العنوان  (١) ،  وقال حاجي خليفة:   "أمالي الإمام فخر الدين قاضي خان في الفقه"   (٢) .

ولعلّه هو المراد عند الإمام الذهبي بقوله في  "السير" :  "وأملى مجالسَ كثيرة رأيتها"   (٣) ، وقال في  "تاريخ الإسلام" :  "رأيت مجلدا من أماليه في سنة سبع، وسنة ثمان، وسنة تسع وثمانين وخمسمِائة"   (٤) .

وذكره واستفاد منه الشيخ عبد الغني الغنيمي الميداني في شرحه لمختصر القدوري:   "اللباب في شرح الكتاب"   (٥) ، وصاحب  "الفتاوى التاتارخانية"   (٦) .

٧ -  " كتاب المحاصر" :

ذكره حاجي خليفة وإسماعيل باشا بهذا العنوان  (٧) ، وذكره الكفوي ومنه اللكنوي باسم  "المحاضر"   (٨) .

وتوجد نسخة منه في قسم المخطوطات بمكتبة الجامعة الإسلامية بالمدينة المنورة بعنوان

(١) "هدية العارفين" ٥/ ٢٨٠، "الفوائد البهية" ص ٦٥.

(٢) "كشف الظنون" ١/ ١٦٥.

(٣) "سير أعلام النبلاء" للذهبي، ٢١/ ٢٨٥.

(٤) "تاريخ الإسلام" للذهبي ٤٠/ ٣٩٨، ونقله قاسم بن قُطلوبُغا في "تاج التراجم" ص ٨٢.

(٥) انظر مقدمّة "اللباب في شرح الكتاب" تعليق وتخريج الشيخ عبد الرزاق المهدي ١/ ١٦.

(٦) انظر مقدمة "الفتاوى التتارخانية" ١/ ٤٦.

(٧) "كشف الظنون" ٢/ ١٤٥٦، و "هدية العارفين" ٥/ ٢٨٠.

(٨) "الفوائد البهية" ص ٦٥.'),
('fatawa-qazi-khan', 'الواقعات', 97, '"المحاضر والسجلات" ، بخط الشيخ أبي الوفاء الأفغاني  (١) .

٨ -  " الواقعات" :

ذكره الكفوي واللكنوي بهذا الاسم،  وذكره حاجي خليفة وإسماعيل باشا بعنوان:   "الواقعات في الفروع" .

[٩ -  " فوائد الإمام قاضيخان" ]

ذكره حاجي خليفة  (٢) ، وأحال إليه الإمام محمد بن محمود الاسروشني المتوفى ٦٣٢ هـ في كتابه الشهير  "جامع أحكام الصغار"  في مسائل الحدود، وفي مسائل الغصب والضمان  (٣) .

وهناك بعض المؤلفات تنسب إلى الإمام قاضي خان وجدتها أثناء تتبعي فهارس المخطوطات لمكتبات العالم، إلا أنني لم أتمكّن من الاطلاع على محتوياتها وبالتالي التأكد من صحّة نسبتها إلى الإمام قاضي خان،  وأسردها فيما يلي:

١٠ -  " رسم المفتي"  أو  "عمدة المفتي" :

توجد نسخة منه في مكتبة الأوقاف العامّة ببغداد، باسم  "رسم المفتي" ،  أوّله:  الحمد لله رب العالمين … وآخره: تمّ الفراغ من نسخه في سنة ١٠٤٧ هـ على يد أحمد بن عمر الحنفي القادري. عدد أوراقه ٨٩.

كما توجد نسخة منه في مكتبة فيض الله آفندي استنبول،  بعنوان:   "عمدة المفتي"  تحت رقم ١٠٣٤، في ٩٠ ورق.

وكذلك يوجد كتاب في مكتبة أحمد الثالث بعنوان  "أدب المفتي لقاضي خان" ، تحت رقم ١٠١٨، وورقه ٣٦١، والظاهر من حجمه أنه نسخة من فتاوى قاضي خان، فإنه يفتتح بفصل في رسم المفتي.

(١) تحت رقم ٧٩٦ ف، وعدد أوراقه ١٠٨، نسَخه في سنة ١٣٥٣ هـ.

(٢) "كشف الظنون" ٢/ ١٢٩٥.

(٣) انظر "جامع أحكام الصغار" ٢/ ٧٣ و ١٥٠.'),
('fatawa-qazi-khan', 'آداب الفضلاء في اللغة', 98, '١١ -  " آداب الفضلاء"  في اللغة:

ذكره إسماعيل باشا البغدادي في مصنفات قاضي خان. ولم يثبت عند غيره من أصحاب التراجم.

[١٢ -  " الإصلاح شرح الإيضاح" ]

توجد له عدة نسخ في مكتبة لاله لي باستنبول، في مجلد واحد، تحت رقم ٨١٥، ٨١٦، ٨١٧، ٨١٨.

١٣ -  " خزانة الروايات" :

خزانة الروايات في الفروع، لقاضي خان، توجد نسخة منها في مكتبة أيا صوفيا باستنبول، تحت رقم ١١٤٧، وفي ٧٠ صفحة.'),
('fatawa-qazi-khan', 'الفصل الثالث', 99, '[الفصل الثالث]

ويشتمل على مبحثين:

المبحث الأول كتاب الزيادات

للإمام محمد بن الحسن الشيباني

المبحث الثاني  "شرح الزيادات"  للإمام قاضي خان'),
('fatawa-qazi-khan', 'المبحث الأول كتاب الزيادات للإمام محمد بن الحسن الشيباني', 100, '[المبحث الأول كتاب الزيادات للإمام محمد بن الحسن الشيباني]

" الزيادات"  من كتب ظاهر الرواية:

تكاد تتفق كلمة الفقهاء من المتقدمين والمتأخرين ومؤلفي كتب الطبقات والمصنفات وأصحاب التراجم على أن  "الزيادات"  من كتب ظاهر الرواية التي يتكوّن بها المرجع الأساسي للفقه الحنفي، لأنها مروية عن الإمام محمد روايات مشتهرة بطريق الثقات.

وينسب إلى بعض العلماء أنهم اعتبروا كتاب الزيادات في النوادر، وليس من كتب ظاهر الرواية، ولكن الأكثرين يعدونه منها، وهو الصحيح، وهو اختيار العلامة ابن عابدين وطاش كبري زاده، والعلامة اللكنوي والأستاذ أبي زهرة  (١) ، ومحمد زاهد الكوثري، والشيخ أبي الوفاء الأفغاني.

أشار إليه العلامة ابن عابدين في منظومته  "رسم المفتي"  بهذه الأبيات:

وكتب ظاهر الرواية أتت … ستا وبالأصول أيضا سمّيت

(١) ذكر صاحب مفتاح السعادة أن مما تطابقت عليه كلمة الفقهاء التعبير من "المبسوط" و "الزيادات" و "الجامعين" برواية الأصول. ٢/ ٢٦٣، وانظر: "النافع الكبير لمن يطالع الجامع الصغير" لللكنوي، ص ٩٧، و"أبو حنيفة" لأبي زهرة ص: ٢١٥.'),
('fatawa-qazi-khan', 'الزيادات من كتب ظاهر الرواية', 101, 'صنفها محمد الشيباني … حرر فيها المذهب النعماني

الجامع الصغير والكبير … والسير الكبير والصغير

ثم الزيادات مع المبسوط … تواترت بالسند المضبوط  (١)

وقال الشيخ الكوثري بعد أن تكلم عن  "الزيادات"  و  "زيادات الزيادات" :  "وتُعدان من أبدع كتبه … وهما من الكتب المروية عنه بطريق الشهرة وغلط من ذكرهما في عداد النوادر  (٢)  وعلق عليه الشيخ أبو الوفاء مؤيدا لذلك: " ويؤيد هذا القول شروح الأئمة لها، لأنهم لم يشرحوا النوادر، لأنهم ليس لهم علم بدلائل النوادر وأصولها، وفي مناقب الكردري  (٣)  عن ابن جبلة: قال سمعت محمد يقول: لا يحل لأحد أن يروي عن كتبنا إلا ما سمع أن يعلم مثلَ ما علمنا "  (٤) .

ثم إنني وجدت نصا على ذلك من صاحب الهداية وشارحه البابرتي في " العناية "،  قال المرغيناني في كتاب الصيد:  " ولا بد من الجرح في ظاهر الرواية ليتحقق الذكاة لاضطرارية، وهو الجرح في أي موضع كان من البدني "،  فعلق عليه الفقيه البابرتي قائلا:  " قوله:  "في ظاهر الرواية"  يريد رواية الزيادات،  فإنه قال:  لو قتل الكلب أو البازى الصيد من غير جرح لا يحل، وأشار في الأصل إلى إنه يحل، والفتوى على ظاهر الرواية"  (٥) .

(١) انظر مجموعة رسائل ابن عابدين، "شرح عقود رسم المفتي" ص ١٦.

(٢) بلوغ الأماني في سيرة الإمام محمد الشيباني ص ٦٤.

(٣) ج ٢/ ١٥٢.

(٤) انظر مقدمة "شرح زيادات الزيادات" ص ٨، طبع لجنة إحياء المعارف النعمانية بحيدرآباد، الهند.

(٥) راجع "العناية" بهامش فتح القدير ١٠/ ١٣٥.'),
('fatawa-qazi-khan', 'سبب تأليف الزيادات', 102, '[سبب تأليف الزيادات]

ذكر العلماء عدة روايات في سبب تأليفه:

فمنها ما روي أن الإمام أبا يوسف لما فرع فروعا دقيقة في أحد مجالس إملائه قال:  يشق تفريع هذه المسائل على محمد بن الحسن، ولما بلغه ذلك، ألف  "الزيادات"  لتكون حجة على أن أمثال تلك الفروع وما هو أدق منها لا يشق عليه تفريعها  (١) .

ومن المؤرخين من يرى أن هذه المسائل إضافات للمبسوط  (٢) .

ومنهم من يرى أن  "الزيادات"  يلتحق بالكتب الخمسة، وضعه الإمام محمد إكمالا لها وتفريعا عن مسائلها  (٣) .

ومنهم من يرى أنها إضافات للجامع الكبير  (٤) ، وهذا هو الراجح،  لما تبين لي من الأمور التالية:

- مما يروى عن الترتيب الزمني لتصنيف  "الزيادات"  أن الإمام محمد رحمه الله لما فرغ من تأليف  "الجامع الكبير"  تذكر فروعا أخر لم يذكرها فيه، فصنف كتابا آخر ليذكر فيه تلك الفروع، وسماه  "الزيادات" ، ثم تذكر فروعا أخرى، فصنف كتابا آخر ليذكر فيه تلك الفروع الأخرى، وسماه  "زيادات الزيادات" ، فقطع عن ذلك ولم يتمه،  قال الشيخ أبو الوفاء الأفغاني بعد أن حكى ذلك:   "كذا قاله قاضي خان في شرحه"   (٥) .

(١) بلوغ الأماني ص: ٦٤.

(٢) بروكلمان ٣/ ٢٤٩.

(٣) وهو الأستاذ الشيخ محمد الفاضل بن عاشور، مجلة الأزهر السنة السادسة والثلاثون ص: ٩٠٩.

(٤) نظرة عامة في تاريخ الفقه الإسلامي ص: ٢٤٩.

(٥) مقدمة "شرح زيادات الزيادات" ص ١، ولعله يقصد "شرح الجامع الصغير" لقاضي خان، فإنني لم أجد هذا الكلام في "شرح الزيادات".'),
('fatawa-qazi-khan', 'أسلوب الكتاب ومنهجه', 103, '- يؤيد ذلك ما ثبت في بعض نسخ  "منتخب شرح الزيادات"  الذي انتخبه صدر الدين سليمان بن وهب من  "شرح الزيادات"  لقاضي خان،  فجاء عنوان الكتاب كالتالي:   "الزيادات على الجامع الكبير" ، محفوظ في قسم المخطوطات بدار الكتب المصرية تحت رقم ١٢٤٢/ فقه حنفي.

- وهو اختيار الفقيه محمد بن محمد الملقب برضي الدين السرخسى، مصنف  "المحيط الرضوي"  من الكتب الفقهى الموسوعي في أربعين مجلدًا،  نقل اللكنوي عنه:   "جمعتُ في هذا الكتاب عامة مسائل الفقه مع مبانيها على حسن ترتيبها،  وجودة تقسيمها إلى أن قال:  وبدأت كل باب بمسائل المبسوط لما أنها أصول مثبتة، وأردفتها بمسائل النوادر والنوازل؛ لما أنها من أصول المسائل منزوعة، ثم أعقبتها بمسائل الجامع؛ لما أنها من زبدة الفقه مجموعة، ثم ختمتها بمسائل الزيادات لما أنها على فروع الجامع مزيدة، وسميته محيطا لما أنه محيط بمسائل الكتب  (١) .

- ولأن منهج الإمام محمد في " الزيادات " يطابق تماما منهجَه في الجامع الكبير، فهو يسرد المسائل في عبارات دقيقة جامعة دون ذكر للأدلة.

[أسلوب الكتاب ومنهجه]

يتضح مما سبق أن كتاب الزيادات تكملة للجامع الكبير، فالمنهج الذي سار عليه الإمام محمد في " الزيادات " يطابق تماما منهجه في الجامع الكبير، فأسلوبه فيه محكم رصين يغلب عليه طابع الدقة والصعوبة لانطوائه على فروق فقهية دقيقة وعلل خفية، فهو يذكر المسائل في عبارات دقيقة جامعة دون ذكر للأدلة،  لذا أشار إليه الإمام محمد بن شجاع الثلجي بقوله:  " مثل محمد بن الحسن في  "الجامع الكبير" : كرجل بنى دارا، فكان كلما على، بنى مرفاة يرقى منها إلى ما علاه من الدار، حتى استتم بناءها كذلك، ثم نزل عنها، وهدم

(١) "الفوائد البهية" ص ١٩١.'),
('fatawa-qazi-khan', 'أسلوب الكتاب ومنهجه', 104, 'مراقيها، ثم قال للناس شأنكم فاصعدوا "  (١) .

وأعظم مثال على دقة أسلوبه في الكتاب:  " الأيمان ".  يقول الأمام السرخسي رحمه الله:  " من أراد امتحان المتبحرين في الفقه، فعليه بأيمان الجامع ".  (٢)  وذلك دأبه في " أيمان الزيادات " أيضًا من حيث تضلعه ورسوخه التام في الفقه والأصول وقواعد اللغة.

ولصعوبة مسائل الزيادت أشار إليه الناظم يصفه في تلك الأبيات:

إن الزيادات زاد الله رونقها … عقم مسائلها من أصعب الكتب

أصولها كالعذارى قط ما اقترعت … فروعهن يد في العجم والعرب

ينال قارئها في العلم منزلة … يغيب إدراكها عن أعين الشهب  (٣)

وهو يمثّل الفروع الفقهية بدون توجيه أو تعليق للمسائل، ولكن القارئ الملم بالفقه يدرك ذلك بالنظر في ثنايا المسائل، لأنها لم تدون إلا بعد المداولة واقتناع كل بما يذهب إليه، بناء على الدليل، فإنها خلاصة الجهود وثمرتها.

وأسلوبه في الكتاب لا يخلو عما يسمى بالفقه التقديري، ويقصد به الفتوى في مسائل لم تقع ويفرض وقوعها وكان هذا المنهج متبعا في زمنه لتدوين المسائل بإيراد الصور مفروضة الوقوع لا واقعة نازلة وتفريع الصورة من الصورة، والاجتهاد في تقرير الحكم الشرعي المنطبق على كل صورة من تلك الصور المفروضة المتسلسلة على النحو الذي تؤلف عليه القوانين الآن، وقد أعطى التدوين الفقهي صورة جديدة من البسط تتمثل في استيعاب المسائل بطريقة افتراض، بعد أن كان يقتصر فيها على النوازل الواقعة.

" وقد كثر هذا النوع من الفقه لدى الفقهاء، لأنهم يحاولون بذلك استخراج العلل

(١) الذهبي، مناقب أبي حنيفة وصاحبيه ص ٨٩ - ٩٠.

(٢) شرح السير الكبير ١/ ٢٥٢.

(٣) انظر مقدمة "شرح زيادات الزيادات" ص ٨، طبع لجنة إحياء المعارف النعمانية بحيدرآباد.');